project.org
** DONE Player register() fn should need a password as input.
CLOSED: [2024-01-28 Sun 15:52]
