project.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2024-01-31 Wed 10:19 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgd42c513">1. Task Board</a>
<ul>
<li><a href="#orgeb3ac2c">1.1. <span class="done DONE">DONE</span> Player register() fn should need a password as input.</a></li>
<li><a href="#orga6beca0">1.2. <span class="todo TODO">TODO</span> Task should invoke onSuccess(),onFailure() before postask middleware</a></li>
<li><a href="#org26c828f">1.3. Task template</a>
<ul>
<li><a href="#orge8bc181">1.3.1. <span class="todo TODO">TODO</span> Object schema for req/res backend topic payload</a></li>
<li><a href="#org4eb714f">1.3.2. <span class="todo TODO">TODO</span> Implement backend api topic call</a></li>
<li><a href="#org2d20fa5">1.3.3. <span class="todo TODO">TODO</span> Implement Task and Command</a></li>
<li><a href="#org067f629">1.3.4. <span class="todo TODO">TODO</span> Document the req/res payload</a></li>
</ul>
</li>
<li><a href="#org4141263">1.4. Entity template</a></li>
<li><a href="#orgb41e511">1.5. <span class="done DONE">DONE</span> Implement writsband scan</a>
<ul>
<li><a href="#org25b62f8">1.5.1. <span class="done DONE">DONE</span> Object schema for req/res backend topic payload</a></li>
<li><a href="#org2086172">1.5.2. <span class="done DONE">DONE</span> Implement backend api topic call</a></li>
<li><a href="#org51ca798">1.5.3. <span class="done DONE">DONE</span> Implement Task and Command</a></li>
<li><a href="#orgca107c0">1.5.4. <span class="done DONE">DONE</span> Document the req/res payload</a></li>
</ul>
</li>
<li><a href="#orgbf1daaa">1.6. <span class="done DONE">DONE</span> Implement wristband register</a>
<ul>
<li><a href="#orgc3ebce8">1.6.1. <span class="done DONE">DONE</span> Object schema for req/res backend topic payload</a></li>
<li><a href="#org3f25a98">1.6.2. <span class="done DONE">DONE</span> Implement backend api topic call</a></li>
<li><a href="#org65ca6c1">1.6.3. <span class="done DONE">DONE</span> Implement Task and Command</a></li>
<li><a href="#org6355f4c">1.6.4. <span class="done DONE">DONE</span> Document the req/res payload</a></li>
</ul>
</li>
<li><a href="#orged9282e">1.7. <span class="todo TODO">TODO</span> Implement wristband deregister</a>
<ul>
<li><a href="#org928d7b9">1.7.1. <span class="done DONE">DONE</span> Object schema for req/res backend topic payload</a></li>
<li><a href="#org25ea716">1.7.2. <span class="done DONE">DONE</span> Implement backend api topic call</a></li>
<li><a href="#org49dfe97">1.7.3. <span class="done DONE">DONE</span> Implement Task and Command</a></li>
<li><a href="#org431b67c">1.7.4. <span class="done DONE">DONE</span> Document the req/res payload</a></li>
</ul>
</li>
<li><a href="#orga4880d9">1.8. <span class="done DONE">DONE</span> Implement getWristbandInfo</a>
<ul>
<li><a href="#orgb4f1089">1.8.1. <span class="done DONE">DONE</span> Object schema for req/res backend topic payload</a></li>
<li><a href="#orgef169d7">1.8.2. <span class="done DONE">DONE</span> Implement backend api topic call</a></li>
<li><a href="#org721f533">1.8.3. <span class="done DONE">DONE</span> Implement Task and Command</a></li>
<li><a href="#orgb629da0">1.8.4. <span class="done DONE">DONE</span> Document the req/res payload</a></li>
</ul>
</li>
<li><a href="#org6e0c1eb">1.9. <span class="todo TODO">TODO</span> Team entity</a></li>
<li><a href="#org3cd7613">1.10. <span class="todo TODO">TODO</span> Team Roster</a></li>
<li><a href="#orgdc245d9">1.11. <span class="done DONE">DONE</span> Implement list Registered Players</a>
<ul>
<li><a href="#org59c54d3">1.11.1. <span class="done DONE">DONE</span> Object schema for req/res backend topic payload</a></li>
<li><a href="#orgd229804">1.11.2. <span class="done DONE">DONE</span> Implement backend api topic call</a></li>
<li><a href="#orgf412c72">1.11.3. <span class="done DONE">DONE</span> Implement task and Command</a></li>
<li><a href="#org10ea459">1.11.4. <span class="done DONE">DONE</span> Document the req/res payload</a></li>
<li><a href="#org09cb39b">1.11.5. <span class="done DONE">DONE</span> Verify Player.normalize() and Wristband.normalize()</a></li>
</ul>
</li>
<li><a href="#org5c9af9c">1.12. <span class="done DONE">DONE</span> Implement list Registered Players with a Wristband</a>
<ul>
<li><a href="#orge50c05f">1.12.1. <span class="done DONE">DONE</span> Object schema for req/res backend topic payload</a></li>
<li><a href="#org8e464d9">1.12.2. <span class="done DONE">DONE</span> Implement backend api topic call</a></li>
<li><a href="#org4599565">1.12.3. <span class="done DONE">DONE</span> Implement Task and Command</a></li>
<li><a href="#org91f2d2f">1.12.4. <span class="done DONE">DONE</span> Document the req/res payload</a></li>
<li><a href="#org6ec40ca">1.12.5. <span class="done DONE">DONE</span> Verify Player.normalize() and Wristband.normalize()</a></li>
</ul>
</li>
<li><a href="#org635e2fb">1.13. <span class="done DONE">DONE</span> Implement list Packages</a>
<ul>
<li><a href="#org5b906d7">1.13.1. <span class="done DONE">DONE</span> Object schema for req/res backend topic payload</a></li>
<li><a href="#org453129d">1.13.2. <span class="done DONE">DONE</span> Implement backend api topic call</a></li>
<li><a href="#org5515706">1.13.3. <span class="done DONE">DONE</span> Implement Task and Command</a></li>
<li><a href="#org6849ad9">1.13.4. <span class="done DONE">DONE</span> Document the req/res payload</a></li>
<li><a href="#orgf9d1e6e">1.13.5. <span class="done DONE">DONE</span> Verify Package.normalize()</a></li>
</ul>
</li>
<li><a href="#orgd70c50a">1.14. <span class="todo TODO">TODO</span> Implement list Cashiers</a>
<ul>
<li><a href="#org7974a04">1.14.1. <span class="todo TODO">TODO</span> Object schema for req/res backend topic payload</a></li>
<li><a href="#orgad7b3c2">1.14.2. <span class="todo TODO">TODO</span> Implement backend api topic call</a></li>
<li><a href="#org25c14b0">1.14.3. <span class="todo TODO">TODO</span> Implement Task and Command</a></li>
<li><a href="#orge8c62be">1.14.4. <span class="todo TODO">TODO</span> Document the req/res payload</a></li>
<li><a href="#org8d32cac">1.14.5. <span class="todo TODO">TODO</span> Verify Cashier.normalize()</a></li>
</ul>
</li>
<li><a href="#orgc4c825c">1.15. <span class="todo TODO">TODO</span> Implement list Devices</a>
<ul>
<li><a href="#orgda45b04">1.15.1. <span class="todo TODO">TODO</span> Object schema for req/res backend topic payload</a></li>
<li><a href="#org58dca00">1.15.2. <span class="todo TODO">TODO</span> Implement backend api topic call</a></li>
<li><a href="#org63ffd62">1.15.3. <span class="todo TODO">TODO</span> Implement Task and Command</a></li>
<li><a href="#orgf63d0bd">1.15.4. <span class="todo TODO">TODO</span> Document the req/res payload</a></li>
<li><a href="#org7c127a7">1.15.5. <span class="todo TODO">TODO</span> Verify Device.normalize()</a></li>
</ul>
</li>
<li><a href="#org7161e24">1.16. <span class="todo TODO">TODO</span> Implement list Scoreboard Devices</a>
<ul>
<li><a href="#orgca226a2">1.16.1. <span class="todo TODO">TODO</span> Object schema for req/res backend topic payload</a></li>
<li><a href="#org29c55b8">1.16.2. <span class="todo TODO">TODO</span> Implement backend api topic call</a></li>
<li><a href="#org42f3ee9">1.16.3. <span class="todo TODO">TODO</span> Implement Task and Command</a></li>
<li><a href="#orga5b2aa8">1.16.4. <span class="todo TODO">TODO</span> Document the req/res payload</a></li>
<li><a href="#org8e710cd">1.16.5. <span class="todo TODO">TODO</span> Verify Device.normalize()</a></li>
</ul>
</li>
<li><a href="#org4297288">1.17. <span class="todo TODO">TODO</span> Implement list Scoreboard Device Views</a>
<ul>
<li><a href="#orgb4df09c">1.17.1. <span class="todo TODO">TODO</span> Object schema for req/res backend topic payload</a></li>
<li><a href="#org98cbe3b">1.17.2. <span class="todo TODO">TODO</span> Implement backend api topic call</a></li>
<li><a href="#org63eadb4">1.17.3. <span class="todo TODO">TODO</span> Implement Task and Command</a></li>
<li><a href="#orgaf072d1">1.17.4. <span class="todo TODO">TODO</span> Document the req/res payload</a></li>
<li><a href="#org6923d6e">1.17.5. <span class="todo TODO">TODO</span> Verify Device.normalize()</a></li>
</ul>
</li>
<li><a href="#orge752e42">1.18. <span class="todo TODO">TODO</span> ImpLement list Scoreboard</a>
<ul>
<li><a href="#orgf108ee9">1.18.1. <span class="todo TODO">TODO</span> Object schema for req/res backend topic payload</a></li>
<li><a href="#org616d787">1.18.2. <span class="todo TODO">TODO</span> Implement backend api topic call</a></li>
<li><a href="#org1e6289e">1.18.3. <span class="todo TODO">TODO</span> Implement Task and Command</a></li>
<li><a href="#orgfe37f24">1.18.4. <span class="todo TODO">TODO</span> Document the req/res payload</a></li>
<li><a href="#org8edac11">1.18.5. <span class="todo TODO">TODO</span> Verify Team.normalize()</a></li>
</ul>
</li>
<li><a href="#org46c0380">1.19. <span class="todo TODO">TODO</span> Implement list Teams</a>
<ul>
<li><a href="#orgf796f17">1.19.1. <span class="todo TODO">TODO</span> Object schema for req/res backend topic payload</a></li>
<li><a href="#org3af651f">1.19.2. <span class="done DONE">DONE</span> Implement backend api topic call</a></li>
<li><a href="#orge10930d">1.19.3. <span class="todo TODO">TODO</span> Implement Task and Command</a></li>
<li><a href="#org8583cf1">1.19.4. <span class="done DONE">DONE</span> Document the req/res payload</a></li>
<li><a href="#org27b5e3f">1.19.5. Backend response</a></li>
<li><a href="#org6fb04da">1.19.6. <span class="todo TODO">TODO</span> Verify Team.normalize()</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orga136af7">2. Communication between objects</a></li>
<li><a href="#org3be503e">3. Afmachine</a></li>
<li><a href="#org1b0a309">4. Small core afm</a></li>
<li><a href="#org4642f0f">5. Afmachine new</a>
<ul>
<li><a href="#org049f2dd">5.1. Command</a></li>
<li><a href="#orge6b2b53">5.2. Difference between events and hooks</a></li>
<li><a href="#org1751063">5.3. Invoking tasks (creating commands)</a></li>
<li><a href="#orgf928a29">5.4. Error handling</a></li>
</ul>
</li>
<li><a href="#org73feb10">6. Command Targets</a></li>
<li><a href="#org23b4e26">7. Tasks</a>
<ul>
<li><a href="#org3238677">7.1. List packages</a></li>
</ul>
</li>
<li><a href="#org7e18151">8. User stories</a>
<ul>
<li><a href="#org1d64aa2">8.1. Administrator toggles wristband pairing mode</a></li>
</ul>
</li>
<li><a href="#org757c058">9. AFM Command pattern</a></li>
<li><a href="#orgde212eb">10. <span class="timestamp-wrapper"><span class="timestamp">&lt;2024-01-24 Wed&gt;</span></span></a>
<ul>
<li><a href="#orgaee1cce">10.1. Entities as the Command initializers</a>
<ul>
<li><a href="#orgd417371">10.1.1. The caches</a></li>
<li><a href="#org5508b3c">10.1.2. The middleware</a></li>
</ul>
</li>
<li><a href="#org467dddd">10.2. Task template</a>
<ul>
<li><a href="#org4ae141b">10.2.1. <span class="todo TODO">TODO</span> Object schema for req/res backend topic payload</a></li>
<li><a href="#orgce86346">10.2.2. <span class="todo TODO">TODO</span> Implement backend api topic call</a></li>
<li><a href="#org1b8e1a1">10.2.3. <span class="todo TODO">TODO</span> Implement Task and Command</a></li>
<li><a href="#org2376776">10.2.4. <span class="todo TODO">TODO</span> Document the req/res payload</a></li>
</ul>
</li>
<li><a href="#orge100699">10.3. <span class="done DONE">DONE</span> Implement register player for fucks sake</a></li>
<li><a href="#org1e5432c">10.4. <span class="done DONE">DONE</span> Implement player.pairWristband()</a></li>
<li><a href="#org20aacf3">10.5. <span class="done DONE">DONE</span> Implement player.unpairWristband()</a></li>
<li><a href="#org2c68e55">10.6. <span class="done DONE">DONE</span> Implement normalization algorithms</a></li>
<li><a href="#org32be7b3">10.7. <span class="done DONE">DONE</span> Implement wristband toggle</a></li>
<li><a href="#orgba065bc">10.8. <span class="todo TODO">TODO</span> Implement wristband register</a>
<ul>
<li><a href="#org6b62d2a">10.8.1. <span class="done DONE">DONE</span> Object schema for req/res backend topic payload</a></li>
<li><a href="#org2b54ec4">10.8.2. <span class="done DONE">DONE</span> Implement backend api topic call</a></li>
<li><a href="#org546530e">10.8.3. <span class="done DONE">DONE</span> Implement Task and Command</a></li>
<li><a href="#org007a945">10.8.4. <span class="done DONE">DONE</span> Document the req/res payload</a></li>
</ul>
</li>
<li><a href="#orgb6b11ee">10.9. <span class="todo TODO">TODO</span> Implement wristband unregister</a>
<ul>
<li><a href="#org592c011">10.9.1. <span class="todo TODO">TODO</span> Object schema for req/res backend topic payload</a></li>
<li><a href="#orgf82c5c6">10.9.2. <span class="todo TODO">TODO</span> Implement backend api topic call</a></li>
<li><a href="#org5354fdb">10.9.3. <span class="todo TODO">TODO</span> Implement Task and Command</a></li>
<li><a href="#orgc2c65fe">10.9.4. <span class="todo TODO">TODO</span> Document the req/res payload</a></li>
</ul>
</li>
<li><a href="#orgbac4cac">10.10. <span class="todo TODO">TODO</span> Implement wristband verify</a>
<ul>
<li><a href="#orgc610bbc">10.10.1. <span class="todo TODO">TODO</span> Object schema for req/res backend topic payload</a></li>
<li><a href="#org085772d">10.10.2. <span class="todo TODO">TODO</span> Implement backend api topic call</a></li>
<li><a href="#org4677063">10.10.3. <span class="todo TODO">TODO</span> Implement Task and Command</a></li>
<li><a href="#org708005d">10.10.4. <span class="todo TODO">TODO</span> Document the req/res payload</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org59849b2">11. <span class="timestamp-wrapper"><span class="timestamp">&lt;2024-01-27 Sat&gt;</span></span></a></li>
<li><a href="#orgef3c17f">12. Conventions</a>
<ul>
<li><a href="#org46e314f">12.1. Commands wrap their return value within an object</a></li>
</ul>
</li>
<li><a href="#org4981fa3">13. Packages</a>
<ul>
<li><a href="#org3ab5c68">13.1. Available packages</a>
<ul>
<li><a href="#orgb26e36e">13.1.1. mission</a></li>
<li><a href="#org8fdf46f">13.1.2. time</a></li>
</ul>
</li>
<li><a href="#orge594dc9">13.2. Active package</a>
<ul>
<li><a href="#orgcdbe211">13.2.1. mission</a></li>
<li><a href="#org7026873">13.2.2. time</a></li>
</ul>
</li>
<li><a href="#orgbc22baa">13.3. Inactive package</a>
<ul>
<li><a href="#org45a628b">13.3.1. mission</a></li>
<li><a href="#org568262d">13.3.2. time</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org1f1e0a7">14. Normalization functions</a>
<ul>
<li><a href="#orgcf6763a">14.1. Normalization options</a>
<ul>
<li><a href="#org9a78dee">14.1.1. Wristband</a></li>
<li><a href="#orgb278929">14.1.2. Player</a></li>
<li><a href="#org99fd190">14.1.3. Package</a></li>
<li><a href="#org3a3cd78">14.1.4. Roster</a></li>
<li><a href="#orge030869">14.1.5. Team</a></li>
<li><a href="#orgfb2dceb">14.1.6. GroupParty</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org5fb2e4c">15. ToObject Functions</a>
<ul>
<li><a href="#org490832b">15.1. tobject options</a>
<ul>
<li><a href="#org240bab9">15.1.1. Wrisband</a></li>
<li><a href="#org1be9987">15.1.2. Package</a></li>
<li><a href="#org8920fb5">15.1.3. Player</a></li>
<li><a href="#org64eadda">15.1.4. Roster</a></li>
<li><a href="#org0148e2e">15.1.5. Team</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org99164b3">16. Fill functions</a>
<ul>
<li><a href="#orgde14e49">16.1. fill options</a>
<ul>
<li><a href="#orgb56feba">16.1.1. wristband</a></li>
<li><a href="#orge900c19">16.1.2. Package</a></li>
<li><a href="#org89ef6c0">16.1.3. player</a></li>
<li><a href="#orgf4db622">16.1.4. Roster</a></li>
<li><a href="#org9a1bb92">16.1.5. Team</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-orgd42c513" class="outline-2">
<h2 id="orgd42c513"><span class="section-number-2">1.</span> Task Board</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-orgeb3ac2c" class="outline-3">
<h3 id="orgeb3ac2c"><span class="section-number-3">1.1.</span> <span class="done DONE">DONE</span> Player register() fn should need a password as input.</h3>
<div class="outline-text-3" id="text-1-1">
</div>
</div>
