project.org
** TODO Task should invoke onSuccess(),onFailure() before postask middleware
** Task template
*** TODO Object schema for req/res backend topic payload
*** TODO Implement backend api topic call
*** TODO Implement Task and Command
*** TODO Document the req/res payload
** Entity template
**** TODO normalization
**** TODO random
**** TODO tobject
**** TODO fill
** DONE Implement writsband scan
CLOSED: [2024-01-28 Sun 15:52]
*** DONE Object schema for req/res backend topic payload
CLOSED: [2024-01-28 Sun 15:52]
*** DONE Implement backend api topic call
CLOSED: [2024-01-28 Sun 15:52]
*** DONE Implement Task and Command
CLOSED: [2024-01-28 Sun 15:52]
*** DONE Document the req/res payload
CLOSED: [2024-01-28 Sun 15:52]
** DONE Implement wristband register
CLOSED: [2024-01-28 Sun 17:15]
*** DONE Object schema for req/res backend topic payload
*** DONE Implement backend api topic call
*** DONE Implement Task and Command
CLOSED: [2024-01-28 Sun 15:50]
*** DONE Document the req/res payload
CLOSED: [2024-01-28 Sun 15:50]
** TODO Implement wristband deregister
*** DONE Object schema for req/res backend topic payload
CLOSED: [2024-01-28 Sun 17:15]
*** DONE Implement backend api topic call
CLOSED: [2024-01-28 Sun 17:27]
*** DONE Implement Task and Command
CLOSED: [2024-01-28 Sun 17:27]
*** DONE Document the req/res payload
CLOSED: [2024-01-28 Sun 17:33]
** DONE Implement getWristbandInfo
CLOSED: [2024-01-28 Sun 17:27]
*** DONE Object schema for req/res backend topic payload
CLOSED: [2024-01-28 Sun 16:09]
*** DONE Implement backend api topic call
CLOSED: [2024-01-28 Sun 17:09]
*** DONE Implement Task and Command
CLOSED: [2024-01-28 Sun 17:09]
*** DONE Document the req/res payload
CLOSED: [2024-01-28 Sun 17:09]
** TODO Team entity
**** TODO normalization
**** TODO random
**** TODO tobject
**** TODO fill
** TODO Team Roster
**** TODO normalization
**** TODO random
**** TODO tobject
**** TODO fill

** DONE Implement list Registered Players
CLOSED: [2024-01-30 Tue 23:04]
*** DONE Object schema for req/res backend topic payload
CLOSED: [2024-01-30 Tue 22:02]
*** DONE Implement backend api topic call
CLOSED: [2024-01-30 Tue 21:41]
*** DONE Implement task and Command
CLOSED: [2024-01-30 Tue 23:04]
*** DONE Document the req/res payload
CLOSED: [2024-01-30 Tue 21:41]
