project.html
<div id="outline-container-orga6beca0" class="outline-3">
<h3 id="orga6beca0"><span class="section-number-3">1.2.</span> <span class="todo TODO">TODO</span> Task should invoke onSuccess(),onFailure() before postask middleware</h3>
</div>
<div id="outline-container-org26c828f" class="outline-3">
<h3 id="org26c828f"><span class="section-number-3">1.3.</span> Task template</h3>
<div class="outline-text-3" id="text-1-3">
</div>
<div id="outline-container-orge8bc181" class="outline-4">
<h4 id="orge8bc181"><span class="section-number-4">1.3.1.</span> <span class="todo TODO">TODO</span> Object schema for req/res backend topic payload</h4>
</div>
<div id="outline-container-org4eb714f" class="outline-4">
<h4 id="org4eb714f"><span class="section-number-4">1.3.2.</span> <span class="todo TODO">TODO</span> Implement backend api topic call</h4>
</div>
<div id="outline-container-org2d20fa5" class="outline-4">
<h4 id="org2d20fa5"><span class="section-number-4">1.3.3.</span> <span class="todo TODO">TODO</span> Implement Task and Command</h4>
</div>
<div id="outline-container-org067f629" class="outline-4">
<h4 id="org067f629"><span class="section-number-4">1.3.4.</span> <span class="todo TODO">TODO</span> Document the req/res payload</h4>
</div>
</div>
<div id="outline-container-org4141263" class="outline-3">
<h3 id="org4141263"><span class="section-number-3">1.4.</span> Entity template</h3>
<div class="outline-text-3" id="text-1-4">
</div>
<ol class="org-ol">
<li><a id="org8e2ad48"></a><span class="todo TODO">TODO</span> normalization<br /></li>
<li><a id="org1df2ed7"></a><span class="todo TODO">TODO</span> random<br /></li>
<li><a id="org8d6dfb1"></a><span class="todo TODO">TODO</span> tobject<br /></li>
<li><a id="org3b15255"></a><span class="todo TODO">TODO</span> fill<br /></li>
</ol>
</div>
<div id="outline-container-orgb41e511" class="outline-3">
<h3 id="orgb41e511"><span class="section-number-3">1.5.</span> <span class="done DONE">DONE</span> Implement writsband scan</h3>
<div class="outline-text-3" id="text-1-5">
</div>
<div id="outline-container-org25b62f8" class="outline-4">
<h4 id="org25b62f8"><span class="section-number-4">1.5.1.</span> <span class="done DONE">DONE</span> Object schema for req/res backend topic payload</h4>
<div class="outline-text-4" id="text-1-5-1">
</div>
</div>
<div id="outline-container-org2086172" class="outline-4">
<h4 id="org2086172"><span class="section-number-4">1.5.2.</span> <span class="done DONE">DONE</span> Implement backend api topic call</h4>
<div class="outline-text-4" id="text-1-5-2">
</div>
</div>
<div id="outline-container-org51ca798" class="outline-4">
<h4 id="org51ca798"><span class="section-number-4">1.5.3.</span> <span class="done DONE">DONE</span> Implement Task and Command</h4>
<div class="outline-text-4" id="text-1-5-3">
</div>
</div>
<div id="outline-container-orgca107c0" class="outline-4">
<h4 id="orgca107c0"><span class="section-number-4">1.5.4.</span> <span class="done DONE">DONE</span> Document the req/res payload</h4>
<div class="outline-text-4" id="text-1-5-4">
</div>
</div>
</div>
<div id="outline-container-orgbf1daaa" class="outline-3">
<h3 id="orgbf1daaa"><span class="section-number-3">1.6.</span> <span class="done DONE">DONE</span> Implement wristband register</h3>
<div class="outline-text-3" id="text-1-6">
</div>
<div id="outline-container-orgc3ebce8" class="outline-4">
<h4 id="orgc3ebce8"><span class="section-number-4">1.6.1.</span> <span class="done DONE">DONE</span> Object schema for req/res backend topic payload</h4>
</div>
<div id="outline-container-org3f25a98" class="outline-4">
<h4 id="org3f25a98"><span class="section-number-4">1.6.2.</span> <span class="done DONE">DONE</span> Implement backend api topic call</h4>
</div>
<div id="outline-container-org65ca6c1" class="outline-4">
<h4 id="org65ca6c1"><span class="section-number-4">1.6.3.</span> <span class="done DONE">DONE</span> Implement Task and Command</h4>
<div class="outline-text-4" id="text-1-6-3">
</div>
</div>
<div id="outline-container-org6355f4c" class="outline-4">
<h4 id="org6355f4c"><span class="section-number-4">1.6.4.</span> <span class="done DONE">DONE</span> Document the req/res payload</h4>
<div class="outline-text-4" id="text-1-6-4">
</div>
</div>
</div>
<div id="outline-container-orged9282e" class="outline-3">
<h3 id="orged9282e"><span class="section-number-3">1.7.</span> <span class="todo TODO">TODO</span> Implement wristband deregister</h3>
<div class="outline-text-3" id="text-1-7">
</div>
<div id="outline-container-org928d7b9" class="outline-4">
<h4 id="org928d7b9"><span class="section-number-4">1.7.1.</span> <span class="done DONE">DONE</span> Object schema for req/res backend topic payload</h4>
<div class="outline-text-4" id="text-1-7-1">
</div>
</div>
<div id="outline-container-org25ea716" class="outline-4">
<h4 id="org25ea716"><span class="section-number-4">1.7.2.</span> <span class="done DONE">DONE</span> Implement backend api topic call</h4>
<div class="outline-text-4" id="text-1-7-2">
</div>
</div>
<div id="outline-container-org49dfe97" class="outline-4">
<h4 id="org49dfe97"><span class="section-number-4">1.7.3.</span> <span class="done DONE">DONE</span> Implement Task and Command</h4>
<div class="outline-text-4" id="text-1-7-3">
</div>
</div>
<div id="outline-container-org431b67c" class="outline-4">
<h4 id="org431b67c"><span class="section-number-4">1.7.4.</span> <span class="done DONE">DONE</span> Document the req/res payload</h4>
<div class="outline-text-4" id="text-1-7-4">
</div>
</div>
</div>
<div id="outline-container-orga4880d9" class="outline-3">
<h3 id="orga4880d9"><span class="section-number-3">1.8.</span> <span class="done DONE">DONE</span> Implement getWristbandInfo</h3>
<div class="outline-text-3" id="text-1-8">
</div>
<div id="outline-container-orgb4f1089" class="outline-4">
<h4 id="orgb4f1089"><span class="section-number-4">1.8.1.</span> <span class="done DONE">DONE</span> Object schema for req/res backend topic payload</h4>
<div class="outline-text-4" id="text-1-8-1">
</div>
</div>
<div id="outline-container-orgef169d7" class="outline-4">
<h4 id="orgef169d7"><span class="section-number-4">1.8.2.</span> <span class="done DONE">DONE</span> Implement backend api topic call</h4>
<div class="outline-text-4" id="text-1-8-2">
</div>
</div>
<div id="outline-container-org721f533" class="outline-4">
<h4 id="org721f533"><span class="section-number-4">1.8.3.</span> <span class="done DONE">DONE</span> Implement Task and Command</h4>
<div class="outline-text-4" id="text-1-8-3">
</div>
</div>
<div id="outline-container-orgb629da0" class="outline-4">
<h4 id="orgb629da0"><span class="section-number-4">1.8.4.</span> <span class="done DONE">DONE</span> Document the req/res payload</h4>
<div class="outline-text-4" id="text-1-8-4">
</div>
</div>
</div>
<div id="outline-container-org6e0c1eb" class="outline-3">
<h3 id="org6e0c1eb"><span class="section-number-3">1.9.</span> <span class="todo TODO">TODO</span> Team entity</h3>
<div class="outline-text-3" id="text-1-9">
</div>
<ol class="org-ol">
<li><a id="orga4a6452"></a><span class="todo TODO">TODO</span> normalization<br /></li>
<li><a id="orgbdaa9c0"></a><span class="todo TODO">TODO</span> random<br /></li>
<li><a id="orgdf7cbd7"></a><span class="todo TODO">TODO</span> tobject<br /></li>
<li><a id="org0abd947"></a><span class="todo TODO">TODO</span> fill<br /></li>
</ol>
</div>
<div id="outline-container-org3cd7613" class="outline-3">
<h3 id="org3cd7613"><span class="section-number-3">1.10.</span> <span class="todo TODO">TODO</span> Team Roster</h3>
<div class="outline-text-3" id="text-1-10">
</div>
<ol class="org-ol">
