project.org
**** Backend response
#+begin_src js
  {
    timestamp: 1706642934817,
    result: 'OK',
    players: [
      {
        username: 'Merry_2mpmnxcgv1s',
        name: 'Merry',
        surname: 'compassionate',
        email: 'Merry@gmail.com',
        wristbandMerged: false,
        wristband: null
      },
      {
        username: 'Wormtongue_klagnkjxqla',
        name: 'Wormtongue',
        surname: 'jovial',
        email: 'Wormtongue@gmail.com',
        wristbandMerged: false,
        wristband: { wristbandNumber: 230, wristbandColor: 3, active: true }
      },
      {
        username: '6t3o5ds227u',
        name: null,
        surname: null,
        email: null,
        wristbandMerged: false,
        wristband: null
      },
      {
        username: 'Elrond_6ofeexn83ma',
        name: 'Elrond',
        surname: 'vigilant',
        email: 'Elrond@gmail.com',
        wristbandMerged: true,
        wristband: { wristbandNumber: 231, wristbandColor: 4, active: true }
      },
      {
        username: 'ppthree',
        name: 'yolothree',
        surname: 'ggthree',
        email: 'ggthree@gmail.com',
        wristbandMerged: false,
        wristband: null
      },
    ]
  }
#+end_src
**** After Player.normalize()
#+begin_src js

  // Player.normalize(backend_res, { depth: 1, defaultState: 'registered' })
  const normalized = [
    {
      username: 'Merry_2mpmnxcgv1s',
      name: 'Merry',
      surname: 'compassionate',
      email: 'Merry@gmail.com',
      state: 'registered',
      wristband: { id: null, color: '', colorCode: null, state: 'unpaired' }
    },
    {
      username: 'Wormtongue_klagnkjxqla',
      name: 'Wormtongue',
      surname: 'jovial',
      email: 'Wormtongue@gmail.com',
      state: 'registered',
      wristband: { id: 230, color: 'green', colorCode: 3, state: 'paired' }
    },
    {
      username: '6t3o5ds227u',
      name: '',
      surname: '',
      email: '',
      state: 'registered',
      wristband: { id: null, color: '', colorCode: null, state: 'unpaired' }
    },
    {
      username: 'Elrond_6ofeexn83ma',
      name: 'Elrond',
      surname: 'vigilant',
      email: 'Elrond@gmail.com',
      state: 'inTeam',
      wristband: { id: 231, color: 'yellow', colorCode: 4, state: 'paired' }
    },
    {
      username: 'ppthree',
      name: 'yolothree',
      surname: 'ggthree',
      email: 'ggthree@gmail.com',
      state: 'registered',
      wristband: { id: null, color: '', colorCode: null, state: 'unpaired' }
    }
  ]
#+end_src
*** DONE Verify Player.normalize() and Wristband.normalize()
CLOSED: [2024-01-30 Tue 21:41]
** DONE Implement list Registered Players with a Wristband
CLOSED: [2024-01-30 Tue 23:39]
*** DONE Object schema for req/res backend topic payload
CLOSED: [2024-01-30 Tue 23:38]
*** DONE Implement backend api topic call
CLOSED: [2024-01-30 Tue 23:24]
*** DONE Implement Task and Command
CLOSED: [2024-01-30 Tue 23:38]
*** DONE Document the req/res payload
CLOSED: [2024-01-30 Tue 23:28]
