project.html
<li><a id="orgc986fcc"></a><span class="todo TODO">TODO</span> normalization<br /></li>
<li><a id="orge2adbf5"></a><span class="todo TODO">TODO</span> random<br /></li>
<li><a id="org2d9dd8f"></a><span class="todo TODO">TODO</span> tobject<br /></li>
<li><a id="org2adbf40"></a><span class="todo TODO">TODO</span> fill<br /></li>
</ol>
</div>

<div id="outline-container-orgdc245d9" class="outline-3">
<h3 id="orgdc245d9"><span class="section-number-3">1.11.</span> <span class="done DONE">DONE</span> Implement list Registered Players</h3>
<div class="outline-text-3" id="text-1-11">
</div>
<div id="outline-container-org59c54d3" class="outline-4">
<h4 id="org59c54d3"><span class="section-number-4">1.11.1.</span> <span class="done DONE">DONE</span> Object schema for req/res backend topic payload</h4>
<div class="outline-text-4" id="text-1-11-1">
</div>
</div>
<div id="outline-container-orgd229804" class="outline-4">
<h4 id="orgd229804"><span class="section-number-4">1.11.2.</span> <span class="done DONE">DONE</span> Implement backend api topic call</h4>
<div class="outline-text-4" id="text-1-11-2">
</div>
</div>
<div id="outline-container-orgf412c72" class="outline-4">
<h4 id="orgf412c72"><span class="section-number-4">1.11.3.</span> <span class="done DONE">DONE</span> Implement task and Command</h4>
<div class="outline-text-4" id="text-1-11-3">
</div>
</div>
<div id="outline-container-org10ea459" class="outline-4">
<h4 id="org10ea459"><span class="section-number-4">1.11.4.</span> <span class="done DONE">DONE</span> Document the req/res payload</h4>
<div class="outline-text-4" id="text-1-11-4">
</div>
<ol class="org-ol">
<li><a id="org8a1a33d"></a>Backend response<br />
<div class="outline-text-5" id="text-1-11-4-1">
<div class="org-src-container">
<pre class="src src-js"><span style="color: #4f97d7;">{</span>
  timestamp: <span style="color: #a45bad;">1706642934817</span>,
  result: <span style="color: #2d9574;">'OK'</span>,
  players: <span style="color: #bc6ec5;">[</span>
    <span style="color: #2d9574;">{</span>
      username: <span style="color: #2d9574;">'Merry_2mpmnxcgv1s'</span>,
      name: <span style="color: #2d9574;">'Merry'</span>,
      surname: <span style="color: #2d9574;">'compassionate'</span>,
      email: <span style="color: #2d9574;">'Merry@gmail.com'</span>,
      wristbandMerged: <span style="color: #a45bad;">false</span>,
      wristband: <span style="color: #a45bad;">null</span>
    <span style="color: #2d9574;">}</span>,
    <span style="color: #2d9574;">{</span>
      username: <span style="color: #2d9574;">'Wormtongue_klagnkjxqla'</span>,
      name: <span style="color: #2d9574;">'Wormtongue'</span>,
      surname: <span style="color: #2d9574;">'jovial'</span>,
      email: <span style="color: #2d9574;">'Wormtongue@gmail.com'</span>,
      wristbandMerged: <span style="color: #a45bad;">false</span>,
      wristband: <span style="color: #67b11d;">{</span> wristbandNumber: <span style="color: #a45bad;">230</span>, wristbandColor: <span style="color: #a45bad;">3</span>, active: <span style="color: #a45bad;">true</span> <span style="color: #67b11d;">}</span>
    <span style="color: #2d9574;">}</span>,
    <span style="color: #2d9574;">{</span>
      username: <span style="color: #2d9574;">'6t3o5ds227u'</span>,
      name: <span style="color: #a45bad;">null</span>,
      surname: <span style="color: #a45bad;">null</span>,
      email: <span style="color: #a45bad;">null</span>,
      wristbandMerged: <span style="color: #a45bad;">false</span>,
      wristband: <span style="color: #a45bad;">null</span>
    <span style="color: #2d9574;">}</span>,
    <span style="color: #2d9574;">{</span>
      username: <span style="color: #2d9574;">'Elrond_6ofeexn83ma'</span>,
      name: <span style="color: #2d9574;">'Elrond'</span>,
      surname: <span style="color: #2d9574;">'vigilant'</span>,
      email: <span style="color: #2d9574;">'Elrond@gmail.com'</span>,
      wristbandMerged: <span style="color: #a45bad;">true</span>,
      wristband: <span style="color: #67b11d;">{</span> wristbandNumber: <span style="color: #a45bad;">231</span>, wristbandColor: <span style="color: #a45bad;">4</span>, active: <span style="color: #a45bad;">true</span> <span style="color: #67b11d;">}</span>
    <span style="color: #2d9574;">}</span>,
    <span style="color: #2d9574;">{</span>
      username: <span style="color: #2d9574;">'ppthree'</span>,
      name: <span style="color: #2d9574;">'yolothree'</span>,
      surname: <span style="color: #2d9574;">'ggthree'</span>,
      email: <span style="color: #2d9574;">'ggthree@gmail.com'</span>,
      wristbandMerged: <span style="color: #a45bad;">false</span>,
      wristband: <span style="color: #a45bad;">null</span>
    <span style="color: #2d9574;">}</span>,
  <span style="color: #bc6ec5;">]</span>
<span style="color: #4f97d7;">}</span>
</pre>
</div>
</div>
</li>
<li><a id="org12bfc93"></a>After Player.normalize()<br />
<div class="outline-text-5" id="text-1-11-4-2">
<div class="org-src-container">
<pre class="src src-js">
<span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">Player.normalize(backend_res, { depth: 1, defaultState: 'registered' })</span>
<span style="color: #4f97d7; font-weight: bold;">const</span> <span style="color: #7590db;">normalized</span> = <span style="color: #4f97d7;">[</span>
  <span style="color: #bc6ec5;">{</span>
    username: <span style="color: #2d9574;">'Merry_2mpmnxcgv1s'</span>,
    name: <span style="color: #2d9574;">'Merry'</span>,
    surname: <span style="color: #2d9574;">'compassionate'</span>,
    email: <span style="color: #2d9574;">'Merry@gmail.com'</span>,
    state: <span style="color: #2d9574;">'registered'</span>,
    wristband: <span style="color: #2d9574;">{</span> id: <span style="color: #a45bad;">null</span>, color: <span style="color: #2d9574;">''</span>, colorCode: <span style="color: #a45bad;">null</span>, state: <span style="color: #2d9574;">'unpaired'</span> <span style="color: #2d9574;">}</span>
  <span style="color: #bc6ec5;">}</span>,
  <span style="color: #bc6ec5;">{</span>
    username: <span style="color: #2d9574;">'Wormtongue_klagnkjxqla'</span>,
    name: <span style="color: #2d9574;">'Wormtongue'</span>,
    surname: <span style="color: #2d9574;">'jovial'</span>,
    email: <span style="color: #2d9574;">'Wormtongue@gmail.com'</span>,
    state: <span style="color: #2d9574;">'registered'</span>,
    wristband: <span style="color: #2d9574;">{</span> id: <span style="color: #a45bad;">230</span>, color: <span style="color: #2d9574;">'green'</span>, colorCode: <span style="color: #a45bad;">3</span>, state: <span style="color: #2d9574;">'paired'</span> <span style="color: #2d9574;">}</span>
  <span style="color: #bc6ec5;">}</span>,
  <span style="color: #bc6ec5;">{</span>
    username: <span style="color: #2d9574;">'6t3o5ds227u'</span>,
    name: <span style="color: #2d9574;">''</span>,
    surname: <span style="color: #2d9574;">''</span>,
    email: <span style="color: #2d9574;">''</span>,
    state: <span style="color: #2d9574;">'registered'</span>,
    wristband: <span style="color: #2d9574;">{</span> id: <span style="color: #a45bad;">null</span>, color: <span style="color: #2d9574;">''</span>, colorCode: <span style="color: #a45bad;">null</span>, state: <span style="color: #2d9574;">'unpaired'</span> <span style="color: #2d9574;">}</span>
  <span style="color: #bc6ec5;">}</span>,
  <span style="color: #bc6ec5;">{</span>
    username: <span style="color: #2d9574;">'Elrond_6ofeexn83ma'</span>,
    name: <span style="color: #2d9574;">'Elrond'</span>,
    surname: <span style="color: #2d9574;">'vigilant'</span>,
    email: <span style="color: #2d9574;">'Elrond@gmail.com'</span>,
    state: <span style="color: #2d9574;">'inTeam'</span>,
    wristband: <span style="color: #2d9574;">{</span> id: <span style="color: #a45bad;">231</span>, color: <span style="color: #2d9574;">'yellow'</span>, colorCode: <span style="color: #a45bad;">4</span>, state: <span style="color: #2d9574;">'paired'</span> <span style="color: #2d9574;">}</span>
  <span style="color: #bc6ec5;">}</span>,
  <span style="color: #bc6ec5;">{</span>
    username: <span style="color: #2d9574;">'ppthree'</span>,
    name: <span style="color: #2d9574;">'yolothree'</span>,
    surname: <span style="color: #2d9574;">'ggthree'</span>,
    email: <span style="color: #2d9574;">'ggthree@gmail.com'</span>,
    state: <span style="color: #2d9574;">'registered'</span>,
    wristband: <span style="color: #2d9574;">{</span> id: <span style="color: #a45bad;">null</span>, color: <span style="color: #2d9574;">''</span>, colorCode: <span style="color: #a45bad;">null</span>, state: <span style="color: #2d9574;">'unpaired'</span> <span style="color: #2d9574;">}</span>
  <span style="color: #bc6ec5;">}</span>
<span style="color: #4f97d7;">]</span>
</pre>
</div>
</div>
</li>
</ol>
</div>
<div id="outline-container-org09cb39b" class="outline-4">
<h4 id="org09cb39b"><span class="section-number-4">1.11.5.</span> <span class="done DONE">DONE</span> Verify Player.normalize() and Wristband.normalize()</h4>
<div class="outline-text-4" id="text-1-11-5">
</div>
</div>
</div>
<div id="outline-container-org5c9af9c" class="outline-3">
<h3 id="org5c9af9c"><span class="section-number-3">1.12.</span> <span class="done DONE">DONE</span> Implement list Registered Players with a Wristband</h3>
<div class="outline-text-3" id="text-1-12">
</div>
