project.org
**** Backend response
#+begin_src js
  const response = {
    timestamp: 1706649848057,
    result: 'OK',
    players: [
      {
        username: 'Gilgalad_wsai1ooow3',
        name: 'Gilgalad',
        surname: 'sweet',
        email: 'Gilgalad@gmail.com',
        wristbandMerged: false,
        wristband: { wristbandNumber: 232, wristbandColor: 4, active: true }
      },
      {
        username: 'Gandalf_deil7sv8j4c',
        name: 'Gandalf',
        surname: 'busy',
        email: 'Gandalf@gmail.com',
        wristbandMerged: false,
        wristband: { wristbandNumber: 233, wristbandColor: 4, active: true }
      },
      {
        username: 'Galadriel_12k3dw52kkhi',
        name: 'Galadriel',
        surname: 'jovial',
        email: 'Galadriel@gmail.com',
        wristbandMerged: false,
        wristband: { wristbandNumber: 235, wristbandColor: 5, active: true }
      }
    ]
  }
#+end_src
**** After Player.normalize()
#+begin_src js
  // Player.normalize(response.players, { depth: 1, state: "registered" })
  const normalize = [
    {
      username: 'Gilgalad_wsai1ooow3',
      name: 'Gilgalad',
      surname: 'sweet',
      email: 'Gilgalad@gmail.com',
      state: 'registered',
      wristband: { id: 232, color: 'yellow', colorCode: 4, state: 'paired' }
    },
    {
      username: 'Gandalf_deil7sv8j4c',
      name: 'Gandalf',
      surname: 'busy',
      email: 'Gandalf@gmail.com',
      state: 'registered',
      wristband: { id: 233, color: 'yellow', colorCode: 4, state: 'paired' }
    },
    {
      username: 'Galadriel_12k3dw52kkhi',
      name: 'Galadriel',
      surname: 'jovial',
      email: 'Galadriel@gmail.com',
      state: 'registered',
      wristband: { id: 235, color: 'blue', colorCode: 5, state: 'paired' }
    }
  ]
  #+end_src
*** DONE Verify Player.normalize() and Wristband.normalize()
CLOSED: [2024-01-30 Tue 23:39]
** DONE Implement list Packages
CLOSED: [2024-01-30 Tue 23:54]
*** DONE Object schema for req/res backend topic payload
CLOSED: [2024-01-30 Tue 21:13]
*** DONE Implement backend api topic call
CLOSED: [2024-01-30 Tue 21:12]
*** DONE Implement Task and Command
CLOSED: [2024-01-30 Tue 21:12]
*** DONE Document the req/res payload
CLOSED: [2024-01-30 Tue 20:53]
**** Backend response
#+begin_src js
  const response = {
    timestamp: 1706640606387,
    result: 'OK',
    packages: [
      { name: 'Per Mission 5', amount: 5, type: 'mission', cost: 50 },
      {
        name: 'Per Mission 10',
        amount: 10,
        type: 'mission',
        cost: 100
      },
      {
        name: 'Per Mission 15',
        amount: 15,
        type: 'mission',
        cost: 150
      },
      {
        name: 'Per Mission 20',
        amount: 20,
        type: 'mission',
        cost: 200
      },
      { name: 'Per Time 30', amount: 30, type: 'time', cost: 50 },
      { name: 'Per Time 60', amount: 60, type: 'time', cost: 100 },
      { name: 'Per Time 90', amount: 90, type: 'time', cost: 150 },
      { name: 'Per Time 120', amount: 120, type: 'time', cost: 200 }
    ]
  }
#+end_src
