project.html
<div id="outline-container-orge50c05f" class="outline-4">
<h4 id="orge50c05f"><span class="section-number-4">1.12.1.</span> <span class="done DONE">DONE</span> Object schema for req/res backend topic payload</h4>
<div class="outline-text-4" id="text-1-12-1">
</div>
</div>
<div id="outline-container-org8e464d9" class="outline-4">
<h4 id="org8e464d9"><span class="section-number-4">1.12.2.</span> <span class="done DONE">DONE</span> Implement backend api topic call</h4>
<div class="outline-text-4" id="text-1-12-2">
</div>
</div>
<div id="outline-container-org4599565" class="outline-4">
<h4 id="org4599565"><span class="section-number-4">1.12.3.</span> <span class="done DONE">DONE</span> Implement Task and Command</h4>
<div class="outline-text-4" id="text-1-12-3">
</div>
</div>
<div id="outline-container-org91f2d2f" class="outline-4">
<h4 id="org91f2d2f"><span class="section-number-4">1.12.4.</span> <span class="done DONE">DONE</span> Document the req/res payload</h4>
<div class="outline-text-4" id="text-1-12-4">
</div>
<ol class="org-ol">
<li><a id="org4f4b784"></a>Backend response<br />
<div class="outline-text-5" id="text-1-12-4-1">
<div class="org-src-container">
<pre class="src src-js"><span style="color: #4f97d7; font-weight: bold;">const</span> <span style="color: #7590db;">response</span> = <span style="color: #4f97d7;">{</span>
  timestamp: <span style="color: #a45bad;">1706649848057</span>,
  result: <span style="color: #2d9574;">'OK'</span>,
  players: <span style="color: #bc6ec5;">[</span>
    <span style="color: #2d9574;">{</span>
      username: <span style="color: #2d9574;">'Gilgalad_wsai1ooow3'</span>,
      name: <span style="color: #2d9574;">'Gilgalad'</span>,
      surname: <span style="color: #2d9574;">'sweet'</span>,
      email: <span style="color: #2d9574;">'Gilgalad@gmail.com'</span>,
      wristbandMerged: <span style="color: #a45bad;">false</span>,
      wristband: <span style="color: #67b11d;">{</span> wristbandNumber: <span style="color: #a45bad;">232</span>, wristbandColor: <span style="color: #a45bad;">4</span>, active: <span style="color: #a45bad;">true</span> <span style="color: #67b11d;">}</span>
    <span style="color: #2d9574;">}</span>,
    <span style="color: #2d9574;">{</span>
      username: <span style="color: #2d9574;">'Gandalf_deil7sv8j4c'</span>,
      name: <span style="color: #2d9574;">'Gandalf'</span>,
      surname: <span style="color: #2d9574;">'busy'</span>,
      email: <span style="color: #2d9574;">'Gandalf@gmail.com'</span>,
      wristbandMerged: <span style="color: #a45bad;">false</span>,
      wristband: <span style="color: #67b11d;">{</span> wristbandNumber: <span style="color: #a45bad;">233</span>, wristbandColor: <span style="color: #a45bad;">4</span>, active: <span style="color: #a45bad;">true</span> <span style="color: #67b11d;">}</span>
    <span style="color: #2d9574;">}</span>,
    <span style="color: #2d9574;">{</span>
      username: <span style="color: #2d9574;">'Galadriel_12k3dw52kkhi'</span>,
      name: <span style="color: #2d9574;">'Galadriel'</span>,
      surname: <span style="color: #2d9574;">'jovial'</span>,
      email: <span style="color: #2d9574;">'Galadriel@gmail.com'</span>,
      wristbandMerged: <span style="color: #a45bad;">false</span>,
      wristband: <span style="color: #67b11d;">{</span> wristbandNumber: <span style="color: #a45bad;">235</span>, wristbandColor: <span style="color: #a45bad;">5</span>, active: <span style="color: #a45bad;">true</span> <span style="color: #67b11d;">}</span>
    <span style="color: #2d9574;">}</span>
  <span style="color: #bc6ec5;">]</span>
<span style="color: #4f97d7;">}</span>
</pre>
</div>
</div>
</li>
<li><a id="org77e904c"></a>After Player.normalize()<br />
<div class="outline-text-5" id="text-1-12-4-2">
<div class="org-src-container">
<pre class="src src-js"><span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">Player.normalize(response.players, { depth: 1, state: "registered" })</span>
<span style="color: #4f97d7; font-weight: bold;">const</span> <span style="color: #7590db;">normalize</span> = <span style="color: #4f97d7;">[</span>
  <span style="color: #bc6ec5;">{</span>
    username: <span style="color: #2d9574;">'Gilgalad_wsai1ooow3'</span>,
    name: <span style="color: #2d9574;">'Gilgalad'</span>,
    surname: <span style="color: #2d9574;">'sweet'</span>,
    email: <span style="color: #2d9574;">'Gilgalad@gmail.com'</span>,
    state: <span style="color: #2d9574;">'registered'</span>,
    wristband: <span style="color: #2d9574;">{</span> id: <span style="color: #a45bad;">232</span>, color: <span style="color: #2d9574;">'yellow'</span>, colorCode: <span style="color: #a45bad;">4</span>, state: <span style="color: #2d9574;">'paired'</span> <span style="color: #2d9574;">}</span>
  <span style="color: #bc6ec5;">}</span>,
  <span style="color: #bc6ec5;">{</span>
    username: <span style="color: #2d9574;">'Gandalf_deil7sv8j4c'</span>,
    name: <span style="color: #2d9574;">'Gandalf'</span>,
    surname: <span style="color: #2d9574;">'busy'</span>,
    email: <span style="color: #2d9574;">'Gandalf@gmail.com'</span>,
    state: <span style="color: #2d9574;">'registered'</span>,
    wristband: <span style="color: #2d9574;">{</span> id: <span style="color: #a45bad;">233</span>, color: <span style="color: #2d9574;">'yellow'</span>, colorCode: <span style="color: #a45bad;">4</span>, state: <span style="color: #2d9574;">'paired'</span> <span style="color: #2d9574;">}</span>
  <span style="color: #bc6ec5;">}</span>,
  <span style="color: #bc6ec5;">{</span>
    username: <span style="color: #2d9574;">'Galadriel_12k3dw52kkhi'</span>,
    name: <span style="color: #2d9574;">'Galadriel'</span>,
    surname: <span style="color: #2d9574;">'jovial'</span>,
    email: <span style="color: #2d9574;">'Galadriel@gmail.com'</span>,
    state: <span style="color: #2d9574;">'registered'</span>,
    wristband: <span style="color: #2d9574;">{</span> id: <span style="color: #a45bad;">235</span>, color: <span style="color: #2d9574;">'blue'</span>, colorCode: <span style="color: #a45bad;">5</span>, state: <span style="color: #2d9574;">'paired'</span> <span style="color: #2d9574;">}</span>
  <span style="color: #bc6ec5;">}</span>
<span style="color: #4f97d7;">]</span>
</pre>
</div>
</div>
</li>
</ol>
</div>
<div id="outline-container-org6ec40ca" class="outline-4">
<h4 id="org6ec40ca"><span class="section-number-4">1.12.5.</span> <span class="done DONE">DONE</span> Verify Player.normalize() and Wristband.normalize()</h4>
<div class="outline-text-4" id="text-1-12-5">
</div>
</div>
</div>
<div id="outline-container-org635e2fb" class="outline-3">
<h3 id="org635e2fb"><span class="section-number-3">1.13.</span> <span class="done DONE">DONE</span> Implement list Packages</h3>
<div class="outline-text-3" id="text-1-13">
</div>
<div id="outline-container-org5b906d7" class="outline-4">
<h4 id="org5b906d7"><span class="section-number-4">1.13.1.</span> <span class="done DONE">DONE</span> Object schema for req/res backend topic payload</h4>
<div class="outline-text-4" id="text-1-13-1">
</div>
</div>
<div id="outline-container-org453129d" class="outline-4">
<h4 id="org453129d"><span class="section-number-4">1.13.2.</span> <span class="done DONE">DONE</span> Implement backend api topic call</h4>
<div class="outline-text-4" id="text-1-13-2">
</div>
</div>
<div id="outline-container-org5515706" class="outline-4">
<h4 id="org5515706"><span class="section-number-4">1.13.3.</span> <span class="done DONE">DONE</span> Implement Task and Command</h4>
<div class="outline-text-4" id="text-1-13-3">
</div>
</div>
<div id="outline-container-org6849ad9" class="outline-4">
<h4 id="org6849ad9"><span class="section-number-4">1.13.4.</span> <span class="done DONE">DONE</span> Document the req/res payload</h4>
<div class="outline-text-4" id="text-1-13-4">
</div>
<ol class="org-ol">
<li><a id="org460e6e9"></a>Backend response<br />
<div class="outline-text-5" id="text-1-13-4-1">
<div class="org-src-container">
<pre class="src src-js"><span style="color: #4f97d7; font-weight: bold;">const</span> <span style="color: #7590db;">response</span> = <span style="color: #4f97d7;">{</span>
  timestamp: <span style="color: #a45bad;">1706640606387</span>,
  result: <span style="color: #2d9574;">'OK'</span>,
  packages: <span style="color: #bc6ec5;">[</span>
    <span style="color: #2d9574;">{</span> name: <span style="color: #2d9574;">'Per Mission 5'</span>, amount: <span style="color: #a45bad;">5</span>, type: <span style="color: #2d9574;">'mission'</span>, cost: <span style="color: #a45bad;">50</span> <span style="color: #2d9574;">}</span>,
    <span style="color: #2d9574;">{</span>
      name: <span style="color: #2d9574;">'Per Mission 10'</span>,
      amount: <span style="color: #a45bad;">10</span>,
      type: <span style="color: #2d9574;">'mission'</span>,
      cost: <span style="color: #a45bad;">100</span>
    <span style="color: #2d9574;">}</span>,
    <span style="color: #2d9574;">{</span>
      name: <span style="color: #2d9574;">'Per Mission 15'</span>,
      amount: <span style="color: #a45bad;">15</span>,
      type: <span style="color: #2d9574;">'mission'</span>,
      cost: <span style="color: #a45bad;">150</span>
    <span style="color: #2d9574;">}</span>,
    <span style="color: #2d9574;">{</span>
      name: <span style="color: #2d9574;">'Per Mission 20'</span>,
      amount: <span style="color: #a45bad;">20</span>,
      type: <span style="color: #2d9574;">'mission'</span>,
      cost: <span style="color: #a45bad;">200</span>
    <span style="color: #2d9574;">}</span>,
    <span style="color: #2d9574;">{</span> name: <span style="color: #2d9574;">'Per Time 30'</span>, amount: <span style="color: #a45bad;">30</span>, type: <span style="color: #2d9574;">'time'</span>, cost: <span style="color: #a45bad;">50</span> <span style="color: #2d9574;">}</span>,
    <span style="color: #2d9574;">{</span> name: <span style="color: #2d9574;">'Per Time 60'</span>, amount: <span style="color: #a45bad;">60</span>, type: <span style="color: #2d9574;">'time'</span>, cost: <span style="color: #a45bad;">100</span> <span style="color: #2d9574;">}</span>,
    <span style="color: #2d9574;">{</span> name: <span style="color: #2d9574;">'Per Time 90'</span>, amount: <span style="color: #a45bad;">90</span>, type: <span style="color: #2d9574;">'time'</span>, cost: <span style="color: #a45bad;">150</span> <span style="color: #2d9574;">}</span>,
    <span style="color: #2d9574;">{</span> name: <span style="color: #2d9574;">'Per Time 120'</span>, amount: <span style="color: #a45bad;">120</span>, type: <span style="color: #2d9574;">'time'</span>, cost: <span style="color: #a45bad;">200</span> <span style="color: #2d9574;">}</span>
  <span style="color: #bc6ec5;">]</span>
<span style="color: #4f97d7;">}</span>
</pre>
</div>
</div>
</li>
