project.org
**** After Package.normalization()
#+begin_src js
  // Packege.normalize(packages, { state: "registered" });
  const normalized = [
    {
      id: null,
      name: 'Per Mission 5',
      type: 'mission',
      amount: 5,
      cost: 50,
      t_start: null,
      t_end: null,
      remainder: null,
      state: 'registered'
    },
    {
      id: null,
      name: 'Per Mission 10',
      type: 'mission',
      amount: 10,
      cost: 100,
      t_start: null,
      t_end: null,
      remainder: null,
      state: 'registered'
    },
    {
      id: null,
      name: 'Per Mission 15',
      type: 'mission',
      amount: 15,
      cost: 150,
      t_start: null,
      t_end: null,
      remainder: null,
      state: 'registered'
    },
    {
      id: null,
      name: 'Per Mission 20',
      type: 'mission',
      amount: 20,
      cost: 200,
      t_start: null,
      t_end: null,
      remainder: null,
      state: 'registered'
    },
    {
      id: null,
      name: 'Per Time 30',
      type: 'time',
      amount: 30,
      cost: 50,
      t_start: null,
      t_end: null,
      remainder: null,
      state: 'registered'
    },
    {
      id: null,
      name: 'Per Time 60',
      type: 'time',
      amount: 60,
      cost: 100,
      t_start: null,
      t_end: null,
      remainder: null,
      state: 'registered'
    },
    {
      id: null,
      name: 'Per Time 90',
      type: 'time',
      amount: 90,
      cost: 150,
      t_start: null,
      t_end: null,
      remainder: null,
      state: 'registered'
    },
    {
      id: null,
      name: 'Per Time 120',
      type: 'time',
      amount: 120,
      cost: 200,
      t_start: null,
      t_end: null,
      remainder: null,
      state: 'registered'
    }
  ]
#+end_src

*** DONE Verify Package.normalize()
CLOSED: [2024-01-30 Tue 20:58]
** DONE Implement list Cashiers
CLOSED: [2024-01-31 Wed 15:43]
*** DONE Object schema for req/res backend topic payload
CLOSED: [2024-01-31 Wed 15:37]
*** DONE Implement backend api topic call
CLOSED: [2024-01-31 Wed 15:33]
*** DONE Implement Task and Command
CLOSED: [2024-01-31 Wed 15:43]
*** DONE Document the req/res payload
CLOSED: [2024-01-31 Wed 15:33]
**** Backend request
#+begin_src js
  {
    timestamp: 1706707779283,
  }
#+end_src
**** Backend response
#+begin_src js
  {
    timestamp: 1706707779283,
    result: 'OK',
    cashiers: [
      { id: 1, username: 'pavlos', email: 'pavlosTester123@gmail.com' },
      { id: 3, username: 'tt', email: 'tt@gmail.com' }
    ]
  }
#+end_src
**** No Normalization required

** DONE Implement list Devices
CLOSED: [2024-01-31 Wed 16:19]
*** DONE Object schema for req/res backend topic payload
CLOSED: [2024-01-31 Wed 16:17]
*** DONE Implement backend api topic call
CLOSED: [2024-01-31 Wed 16:17]
*** DONE Implement Task and Command
CLOSED: [2024-01-31 Wed 16:17]
*** DONE Document the req/res payload
CLOSED: [2024-01-31 Wed 16:17]
**** Backend request
#+begin_src js
  {
    timestamp: 1706709130813,
  }
#+end_src
**** Backend response
#+begin_src js
  {
  timestamp: 1706709130813,
  result: 'OK',
  devices: [
    {
      deviceType: 'SCOREBOARD_SCREEN',
      roomType: 'SCOREBOARD1',
      deviceId: 'scor1',
      macAddress: null,
      ipAddress: null,
      bootedTimestamp: 1702243701606
    },
    {
      deviceType: 'SCOREBOARD_SCREEN',
      roomType: 'SCOREBOARD2',
      deviceId: 'scor2',
      macAddress: null,
      ipAddress: null,
      bootedTimestamp: 1702243701625
    },
    {
      deviceType: 'REGISTRATION_SCREEN',
      roomType: 'ADMINISTRATION1',
      deviceId: '001',
      macAddress: null,
      ipAddress: null,
      bootedTimestamp: 1706707719741
    },
    {
      deviceType: 'RPI_READER',
      roomType: 'ADMINISTRATION1',
      deviceId: 'ADMINISTRATION1Reader',
      macAddress: null,
      ipAddress: null,
      bootedTimestamp: 1705889333198
    }
  ]
}
#+end_src
**** No Normalization
** TODO Implement list Scoreboard Devices
*** TODO Object schema for req/res backend topic payload
*** TODO Implement backend api topic call
*** TODO Implement Task and Command
*** TODO Document the req/res payload
*** TODO Verify Device.normalize()
** TODO Implement list Scoreboard Device Views
*** TODO Object schema for req/res backend topic payload
*** TODO Implement backend api topic call
*** TODO Implement Task and Command
*** TODO Document the req/res payload
*** TODO Verify Device.normalize()
** TODO ImpLement list Scoreboard
*** TODO Object schema for req/res backend topic payload
*** TODO Implement backend api topic call
*** TODO Implement Task and Command
*** TODO Document the req/res payload
