project.html
<li><a id="org8830e28"></a>After Package.normalization()<br />
<div class="outline-text-5" id="text-1-13-4-2">
<div class="org-src-container">
<pre class="src src-js"><span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">Packege.normalize(packages, { state: "registered" });</span>
<span style="color: #4f97d7; font-weight: bold;">const</span> <span style="color: #7590db;">normalized</span> = <span style="color: #4f97d7;">[</span>
  <span style="color: #bc6ec5;">{</span>
    id: <span style="color: #a45bad;">null</span>,
    name: <span style="color: #2d9574;">'Per Mission 5'</span>,
    type: <span style="color: #2d9574;">'mission'</span>,
    amount: <span style="color: #a45bad;">5</span>,
    cost: <span style="color: #a45bad;">50</span>,
    t_start: <span style="color: #a45bad;">null</span>,
    t_end: <span style="color: #a45bad;">null</span>,
    remainder: <span style="color: #a45bad;">null</span>,
    state: <span style="color: #2d9574;">'registered'</span>
  <span style="color: #bc6ec5;">}</span>,
  <span style="color: #bc6ec5;">{</span>
    id: <span style="color: #a45bad;">null</span>,
    name: <span style="color: #2d9574;">'Per Mission 10'</span>,
    type: <span style="color: #2d9574;">'mission'</span>,
    amount: <span style="color: #a45bad;">10</span>,
    cost: <span style="color: #a45bad;">100</span>,
    t_start: <span style="color: #a45bad;">null</span>,
    t_end: <span style="color: #a45bad;">null</span>,
    remainder: <span style="color: #a45bad;">null</span>,
    state: <span style="color: #2d9574;">'registered'</span>
  <span style="color: #bc6ec5;">}</span>,
  <span style="color: #bc6ec5;">{</span>
    id: <span style="color: #a45bad;">null</span>,
    name: <span style="color: #2d9574;">'Per Mission 15'</span>,
    type: <span style="color: #2d9574;">'mission'</span>,
    amount: <span style="color: #a45bad;">15</span>,
    cost: <span style="color: #a45bad;">150</span>,
    t_start: <span style="color: #a45bad;">null</span>,
    t_end: <span style="color: #a45bad;">null</span>,
    remainder: <span style="color: #a45bad;">null</span>,
    state: <span style="color: #2d9574;">'registered'</span>
  <span style="color: #bc6ec5;">}</span>,
  <span style="color: #bc6ec5;">{</span>
    id: <span style="color: #a45bad;">null</span>,
    name: <span style="color: #2d9574;">'Per Mission 20'</span>,
    type: <span style="color: #2d9574;">'mission'</span>,
    amount: <span style="color: #a45bad;">20</span>,
    cost: <span style="color: #a45bad;">200</span>,
    t_start: <span style="color: #a45bad;">null</span>,
    t_end: <span style="color: #a45bad;">null</span>,
    remainder: <span style="color: #a45bad;">null</span>,
    state: <span style="color: #2d9574;">'registered'</span>
  <span style="color: #bc6ec5;">}</span>,
  <span style="color: #bc6ec5;">{</span>
    id: <span style="color: #a45bad;">null</span>,
    name: <span style="color: #2d9574;">'Per Time 30'</span>,
    type: <span style="color: #2d9574;">'time'</span>,
    amount: <span style="color: #a45bad;">30</span>,
    cost: <span style="color: #a45bad;">50</span>,
    t_start: <span style="color: #a45bad;">null</span>,
    t_end: <span style="color: #a45bad;">null</span>,
    remainder: <span style="color: #a45bad;">null</span>,
    state: <span style="color: #2d9574;">'registered'</span>
  <span style="color: #bc6ec5;">}</span>,
  <span style="color: #bc6ec5;">{</span>
    id: <span style="color: #a45bad;">null</span>,
    name: <span style="color: #2d9574;">'Per Time 60'</span>,
    type: <span style="color: #2d9574;">'time'</span>,
    amount: <span style="color: #a45bad;">60</span>,
    cost: <span style="color: #a45bad;">100</span>,
    t_start: <span style="color: #a45bad;">null</span>,
    t_end: <span style="color: #a45bad;">null</span>,
    remainder: <span style="color: #a45bad;">null</span>,
    state: <span style="color: #2d9574;">'registered'</span>
  <span style="color: #bc6ec5;">}</span>,
  <span style="color: #bc6ec5;">{</span>
    id: <span style="color: #a45bad;">null</span>,
    name: <span style="color: #2d9574;">'Per Time 90'</span>,
    type: <span style="color: #2d9574;">'time'</span>,
    amount: <span style="color: #a45bad;">90</span>,
    cost: <span style="color: #a45bad;">150</span>,
    t_start: <span style="color: #a45bad;">null</span>,
    t_end: <span style="color: #a45bad;">null</span>,
    remainder: <span style="color: #a45bad;">null</span>,
    state: <span style="color: #2d9574;">'registered'</span>
  <span style="color: #bc6ec5;">}</span>,
  <span style="color: #bc6ec5;">{</span>
    id: <span style="color: #a45bad;">null</span>,
    name: <span style="color: #2d9574;">'Per Time 120'</span>,
    type: <span style="color: #2d9574;">'time'</span>,
    amount: <span style="color: #a45bad;">120</span>,
    cost: <span style="color: #a45bad;">200</span>,
    t_start: <span style="color: #a45bad;">null</span>,
    t_end: <span style="color: #a45bad;">null</span>,
    remainder: <span style="color: #a45bad;">null</span>,
    state: <span style="color: #2d9574;">'registered'</span>
  <span style="color: #bc6ec5;">}</span>
<span style="color: #4f97d7;">]</span>
</pre>
</div>
</div>
</li>
</ol>
</div>

<div id="outline-container-orgf9d1e6e" class="outline-4">
<h4 id="orgf9d1e6e"><span class="section-number-4">1.13.5.</span> <span class="done DONE">DONE</span> Verify Package.normalize()</h4>
<div class="outline-text-4" id="text-1-13-5">
</div>
</div>
</div>
<div id="outline-container-orgd70c50a" class="outline-3">
<h3 id="orgd70c50a"><span class="section-number-3">1.14.</span> <span class="todo TODO">TODO</span> Implement list Cashiers</h3>
<div class="outline-text-3" id="text-1-14">
</div>
<div id="outline-container-org7974a04" class="outline-4">
<h4 id="org7974a04"><span class="section-number-4">1.14.1.</span> <span class="todo TODO">TODO</span> Object schema for req/res backend topic payload</h4>
</div>
<div id="outline-container-orgad7b3c2" class="outline-4">
<h4 id="orgad7b3c2"><span class="section-number-4">1.14.2.</span> <span class="todo TODO">TODO</span> Implement backend api topic call</h4>
</div>
<div id="outline-container-org25c14b0" class="outline-4">
<h4 id="org25c14b0"><span class="section-number-4">1.14.3.</span> <span class="todo TODO">TODO</span> Implement Task and Command</h4>
</div>
<div id="outline-container-orge8c62be" class="outline-4">
<h4 id="orge8c62be"><span class="section-number-4">1.14.4.</span> <span class="todo TODO">TODO</span> Document the req/res payload</h4>
<div class="outline-text-4" id="text-1-14-4">
</div>
<ol class="org-ol">
<li><a id="org191667a"></a>Backend response<br /></li>
<li><a id="orgd418829"></a>After normalization<br /></li>
</ol>
</div>
<div id="outline-container-org8d32cac" class="outline-4">
<h4 id="org8d32cac"><span class="section-number-4">1.14.5.</span> <span class="todo TODO">TODO</span> Verify Cashier.normalize()</h4>
</div>
</div>
<div id="outline-container-orgc4c825c" class="outline-3">
<h3 id="orgc4c825c"><span class="section-number-3">1.15.</span> <span class="todo TODO">TODO</span> Implement list Devices</h3>
<div class="outline-text-3" id="text-1-15">
</div>
<div id="outline-container-orgda45b04" class="outline-4">
<h4 id="orgda45b04"><span class="section-number-4">1.15.1.</span> <span class="todo TODO">TODO</span> Object schema for req/res backend topic payload</h4>
</div>
<div id="outline-container-org58dca00" class="outline-4">
<h4 id="org58dca00"><span class="section-number-4">1.15.2.</span> <span class="todo TODO">TODO</span> Implement backend api topic call</h4>
</div>
<div id="outline-container-org63ffd62" class="outline-4">
<h4 id="org63ffd62"><span class="section-number-4">1.15.3.</span> <span class="todo TODO">TODO</span> Implement Task and Command</h4>
</div>
<div id="outline-container-orgf63d0bd" class="outline-4">
<h4 id="orgf63d0bd"><span class="section-number-4">1.15.4.</span> <span class="todo TODO">TODO</span> Document the req/res payload</h4>
</div>
<div id="outline-container-org7c127a7" class="outline-4">
<h4 id="org7c127a7"><span class="section-number-4">1.15.5.</span> <span class="todo TODO">TODO</span> Verify Device.normalize()</h4>
</div>
</div>
<div id="outline-container-org7161e24" class="outline-3">
<h3 id="org7161e24"><span class="section-number-3">1.16.</span> <span class="todo TODO">TODO</span> Implement list Scoreboard Devices</h3>
<div class="outline-text-3" id="text-1-16">
</div>
<div id="outline-container-orgca226a2" class="outline-4">
<h4 id="orgca226a2"><span class="section-number-4">1.16.1.</span> <span class="todo TODO">TODO</span> Object schema for req/res backend topic payload</h4>
</div>
<div id="outline-container-org29c55b8" class="outline-4">
<h4 id="org29c55b8"><span class="section-number-4">1.16.2.</span> <span class="todo TODO">TODO</span> Implement backend api topic call</h4>
</div>
<div id="outline-container-org42f3ee9" class="outline-4">
<h4 id="org42f3ee9"><span class="section-number-4">1.16.3.</span> <span class="todo TODO">TODO</span> Implement Task and Command</h4>
</div>
<div id="outline-container-orga5b2aa8" class="outline-4">
<h4 id="orga5b2aa8"><span class="section-number-4">1.16.4.</span> <span class="todo TODO">TODO</span> Document the req/res payload</h4>
</div>
<div id="outline-container-org8e710cd" class="outline-4">
<h4 id="org8e710cd"><span class="section-number-4">1.16.5.</span> <span class="todo TODO">TODO</span> Verify Device.normalize()</h4>
</div>
</div>
<div id="outline-container-org4297288" class="outline-3">
<h3 id="org4297288"><span class="section-number-3">1.17.</span> <span class="todo TODO">TODO</span> Implement list Scoreboard Device Views</h3>
<div class="outline-text-3" id="text-1-17">
</div>
