project.org
*** TODO Verify Team.normalize()
** DONE Implement list Teams
CLOSED: [2024-01-31 Wed 15:09]
*** DONE Object schema for req/res backend topic payload
CLOSED: [2024-01-31 Wed 15:09]
*** DONE Implement backend api topic call
CLOSED: [2024-01-31 Wed 08:57]
*** DONE Implement Task and Command
CLOSED: [2024-01-31 Wed 15:09]
*** DONE Document the req/res payload
CLOSED: [2024-01-30 Tue 10:28]
**** DONE A team with all Possible Permutations of players and packages
CLOSED: [2024-01-31 Wed 10:26]
***** Backend response
#+begin_src js
  {
    name: 'friendly_Eomer_c3d',
    totalPoints: 0,
    teamState: 'FINISHED',
    created: 1706472198904,
    lastRegisterAttempt: null,
    currentRoster: {
      version: 1,
      players: [
        {
          username: 'test1',
          wristbandNumber: null,
          wristbandColor: null
        },
        {
          username: 'test2',
          wristbandNumber: 1,
          wristbandColor: 2,
        },
        {
          username: "test3",
          wristbandNumber: 1,
          wristbandColor: null,
        },
        {
          username: "test4",
          wristbandNumber: null,
          wristbandColor: 2,
        },
      ]
    },
    roomType: null,
    packages: [
      { // missions registered
        id: 1,
        name: 'Per Mission 5',
        cost: null,
        started: null,
        ended: null,
        missions: 5,
        missionsPlayed: 0,
        active: false
      },
      { // missions being played
        id: 2,
        name: 'Per Mission 10',
        cost: null,
        started: 1706686189153,
        ended: null,
        missions: 10,
        missionsPlayed: 5,
        active: true
      },
      { // missions completed
        id: 3,
        name: 'Per Mission 20',
        cost: null,
        started: 1706686189153,
        ended: 1706686199999,
        missions: 20,
        missionsPlayed: 20,
        active: false,
      },
      { // time registered
        id: 8,
        name: 'Per Time 30',
        cost: null,
        started: null,
        ended: null,
        duration: 1800,
        paused: false,
        active: false
      },
      { // time being played
        id: 5,
        name: 'Per Time 60',
        cost: null,
        started: 1706685129723,
        ended: null,
        duration: 5400,
        paused: false,
        active: true
      },
      { // time finished
        id: 3,
        name: 'Per Time 90',
        cost: null,
        started: 1706473426225,
        ended: 1706478843795,
        duration: 1800,
        paused: false,
        active: false
      },
    ]
  }
#+end_src
