project.html
<div id="outline-container-orgb4df09c" class="outline-4">
<h4 id="orgb4df09c"><span class="section-number-4">1.17.1.</span> <span class="todo TODO">TODO</span> Object schema for req/res backend topic payload</h4>
</div>
<div id="outline-container-org98cbe3b" class="outline-4">
<h4 id="org98cbe3b"><span class="section-number-4">1.17.2.</span> <span class="todo TODO">TODO</span> Implement backend api topic call</h4>
</div>
<div id="outline-container-org63eadb4" class="outline-4">
<h4 id="org63eadb4"><span class="section-number-4">1.17.3.</span> <span class="todo TODO">TODO</span> Implement Task and Command</h4>
</div>
<div id="outline-container-orgaf072d1" class="outline-4">
<h4 id="orgaf072d1"><span class="section-number-4">1.17.4.</span> <span class="todo TODO">TODO</span> Document the req/res payload</h4>
</div>
<div id="outline-container-org6923d6e" class="outline-4">
<h4 id="org6923d6e"><span class="section-number-4">1.17.5.</span> <span class="todo TODO">TODO</span> Verify Device.normalize()</h4>
</div>
</div>
<div id="outline-container-orge752e42" class="outline-3">
<h3 id="orge752e42"><span class="section-number-3">1.18.</span> <span class="todo TODO">TODO</span> ImpLement list Scoreboard</h3>
<div class="outline-text-3" id="text-1-18">
</div>
<div id="outline-container-orgf108ee9" class="outline-4">
<h4 id="orgf108ee9"><span class="section-number-4">1.18.1.</span> <span class="todo TODO">TODO</span> Object schema for req/res backend topic payload</h4>
</div>
<div id="outline-container-org616d787" class="outline-4">
<h4 id="org616d787"><span class="section-number-4">1.18.2.</span> <span class="todo TODO">TODO</span> Implement backend api topic call</h4>
</div>
<div id="outline-container-org1e6289e" class="outline-4">
<h4 id="org1e6289e"><span class="section-number-4">1.18.3.</span> <span class="todo TODO">TODO</span> Implement Task and Command</h4>
</div>
<div id="outline-container-orgfe37f24" class="outline-4">
<h4 id="orgfe37f24"><span class="section-number-4">1.18.4.</span> <span class="todo TODO">TODO</span> Document the req/res payload</h4>
</div>
<div id="outline-container-org8edac11" class="outline-4">
<h4 id="org8edac11"><span class="section-number-4">1.18.5.</span> <span class="todo TODO">TODO</span> Verify Team.normalize()</h4>
</div>
</div>
<div id="outline-container-org46c0380" class="outline-3">
<h3 id="org46c0380"><span class="section-number-3">1.19.</span> <span class="todo TODO">TODO</span> Implement list Teams</h3>
<div class="outline-text-3" id="text-1-19">
</div>
<div id="outline-container-orgf796f17" class="outline-4">
<h4 id="orgf796f17"><span class="section-number-4">1.19.1.</span> <span class="todo TODO">TODO</span> Object schema for req/res backend topic payload</h4>
</div>
<div id="outline-container-org3af651f" class="outline-4">
<h4 id="org3af651f"><span class="section-number-4">1.19.2.</span> <span class="done DONE">DONE</span> Implement backend api topic call</h4>
<div class="outline-text-4" id="text-1-19-2">
</div>
</div>
<div id="outline-container-orge10930d" class="outline-4">
<h4 id="orge10930d"><span class="section-number-4">1.19.3.</span> <span class="todo TODO">TODO</span> Implement Task and Command</h4>
</div>
<div id="outline-container-org8583cf1" class="outline-4">
<h4 id="org8583cf1"><span class="section-number-4">1.19.4.</span> <span class="done DONE">DONE</span> Document the req/res payload</h4>
<div class="outline-text-4" id="text-1-19-4">
</div>
<ol class="org-ol">
<li><a id="orgcceb34f"></a>A team with all Possible Permutations of players and packages<br />
<ol class="org-ol">
<li><a id="org1262ea6"></a>Backend response<br />
<div class="outline-text-6" id="text-1-19-4-1-1">
<div class="org-src-container">
<pre class="src src-js"><span style="color: #4f97d7;">{</span>
  name: <span style="color: #2d9574;">'friendly_Eomer_c3d'</span>,
  totalPoints: <span style="color: #a45bad;">0</span>,
  teamState: <span style="color: #2d9574;">'FINISHED'</span>,
  created: <span style="color: #a45bad;">1706472198904</span>,
  lastRegisterAttempt: <span style="color: #a45bad;">null</span>,
  currentRoster: <span style="color: #bc6ec5;">{</span>
    version: <span style="color: #a45bad;">1</span>,
    players: <span style="color: #2d9574;">[</span>
      <span style="color: #67b11d;">{</span>
        username: <span style="color: #2d9574;">'test1'</span>,
        wristbandNumber: <span style="color: #a45bad;">null</span>,
        wristbandColor: <span style="color: #a45bad;">null</span>
      <span style="color: #67b11d;">}</span>,
      <span style="color: #67b11d;">{</span>
        username: <span style="color: #2d9574;">'test2'</span>,
        wristbandNumber: <span style="color: #a45bad;">1</span>,
        wristbandColor: <span style="color: #a45bad;">2</span>,
      <span style="color: #67b11d;">}</span>,
      <span style="color: #67b11d;">{</span>
        username: <span style="color: #2d9574;">"test3"</span>,
        wristbandNumber: <span style="color: #a45bad;">1</span>,
        wristbandColor: <span style="color: #a45bad;">null</span>,
      <span style="color: #67b11d;">}</span>,
      <span style="color: #67b11d;">{</span>
        username: <span style="color: #2d9574;">"test4"</span>,
        wristbandNumber: <span style="color: #a45bad;">null</span>,
        wristbandColor: <span style="color: #a45bad;">2</span>,
      <span style="color: #67b11d;">}</span>,
    <span style="color: #2d9574;">]</span>
  <span style="color: #bc6ec5;">}</span>,
  roomType: <span style="color: #a45bad;">null</span>,
  packages: <span style="color: #bc6ec5;">[</span>
    <span style="color: #2d9574;">{</span> <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">missions registered</span>
      id: <span style="color: #a45bad;">1</span>,
      name: <span style="color: #2d9574;">'Per Mission 5'</span>,
      cost: <span style="color: #a45bad;">null</span>,
      started: <span style="color: #a45bad;">null</span>,
      ended: <span style="color: #a45bad;">null</span>,
      missions: <span style="color: #a45bad;">5</span>,
      missionsPlayed: <span style="color: #a45bad;">0</span>,
      active: <span style="color: #a45bad;">false</span>
    <span style="color: #2d9574;">}</span>,
    <span style="color: #2d9574;">{</span> <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">missions being played</span>
      id: <span style="color: #a45bad;">2</span>,
      name: <span style="color: #2d9574;">'Per Mission 10'</span>,
      cost: <span style="color: #a45bad;">null</span>,
      started: <span style="color: #a45bad;">1706686189153</span>,
      ended: <span style="color: #a45bad;">null</span>,
      missions: <span style="color: #a45bad;">10</span>,
      missionsPlayed: <span style="color: #a45bad;">5</span>,
      active: <span style="color: #a45bad;">true</span>
    <span style="color: #2d9574;">}</span>,
    <span style="color: #2d9574;">{</span> <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">missions completed</span>
      id: <span style="color: #a45bad;">3</span>,
      name: <span style="color: #2d9574;">'Per Mission 20'</span>,
      cost: <span style="color: #a45bad;">null</span>,
      started: <span style="color: #a45bad;">1706686189153</span>,
      ended: <span style="color: #a45bad;">1706686199999</span>,
      missions: <span style="color: #a45bad;">20</span>,
      missionsPlayed: <span style="color: #a45bad;">20</span>,
      active: <span style="color: #a45bad;">false</span>,
    <span style="color: #2d9574;">}</span>,
    <span style="color: #2d9574;">{</span> <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">time registered</span>
      id: <span style="color: #a45bad;">8</span>,
      name: <span style="color: #2d9574;">'Per Time 30'</span>,
      cost: <span style="color: #a45bad;">null</span>,
      started: <span style="color: #a45bad;">null</span>,
      ended: <span style="color: #a45bad;">null</span>,
      duration: <span style="color: #a45bad;">1800</span>,
      paused: <span style="color: #a45bad;">false</span>,
      active: <span style="color: #a45bad;">false</span>
    <span style="color: #2d9574;">}</span>,
    <span style="color: #2d9574;">{</span> <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">time being played</span>
      id: <span style="color: #a45bad;">5</span>,
      name: <span style="color: #2d9574;">'Per Time 60'</span>,
      cost: <span style="color: #a45bad;">null</span>,
      started: <span style="color: #a45bad;">1706685129723</span>,
      ended: <span style="color: #a45bad;">null</span>,
      duration: <span style="color: #a45bad;">5400</span>,
      paused: <span style="color: #a45bad;">false</span>,
      active: <span style="color: #a45bad;">true</span>
    <span style="color: #2d9574;">}</span>,
    <span style="color: #2d9574;">{</span> <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">time finished</span>
      id: <span style="color: #a45bad;">3</span>,
      name: <span style="color: #2d9574;">'Per Time 90'</span>,
      cost: <span style="color: #a45bad;">null</span>,
      started: <span style="color: #a45bad;">1706473426225</span>,
      ended: <span style="color: #a45bad;">1706478843795</span>,
      duration: <span style="color: #a45bad;">1800</span>,
      paused: <span style="color: #a45bad;">false</span>,
      active: <span style="color: #a45bad;">false</span>
    <span style="color: #2d9574;">}</span>,
  <span style="color: #bc6ec5;">]</span>
<span style="color: #4f97d7;">}</span>
</pre>
</div>
</div>
</li>
