project.org
***** After Team.normalize()
#+begin_src js
  // Team.normalize(response, { depth: 2 });
  {
    name: 'friendly_Eomer_c3d',
    t_created: 1706472198904,
    points: 0,
    packages: [
      {
        id: 1,
        name: 'Per Mission 5',
        type: 'mission',
        amount: 5,
        cost: 0,
        t_start: null,
        t_end: null,
        remainder: 5,
        state: 'registered'
      },
      {
        id: 2,
        name: 'Per Mission 10',
        type: 'mission',
        amount: 10,
        cost: 0,
        t_start: 1706686189153,
        t_end: null,
        remainder: 5,
        state: 'playing'
      },
      {
        id: 3,
        name: 'Per Mission 20',
        type: 'mission',
        amount: 20,
        cost: 0,
        t_start: 1706686189153,
        t_end: 1706686199999,
        remainder: 0,
        state: 'completed'
      },
      {
        id: 8,
        name: 'Per Time 30',
        type: 'time',
        amount: 30,
        cost: 0,
        t_start: null,
        t_end: null,
        remainder: 0,
        state: 'registered'
      },
      {
        id: 5,
        name: 'Per Time 60',
        type: 'time',
        amount: 90,
        cost: 0,
        t_start: 1706685129723,
        t_end: null,
        remainder: 0,
        state: 'playing'
      },
      {
        id: 3,
        name: 'Per Time 90',
        type: 'time',
        amount: 30,
        cost: 0,
        t_start: 1706473426225,
        t_end: 1706478843795,
        remainder: 0,
        state: 'completed'
      }
    ],
    roster: [
      {
        username: 'test1',
        name: '',
        surname: '',
        email: '',
        state: 'inTeam',
        wristband: { id: null, color: '', colorCode: null, state: 'unpaired' }
      },
      {
        username: 'test2',
        name: '',
        surname: '',
        email: '',
        state: 'inTeam',
        wristband: { id: 1, color: 'purple', colorCode: 2, state: 'paired' }
      },
      {
        username: 'test3',
        name: '',
        surname: '',
        email: '',
        state: 'inTeam',
        wristband: { id: 1, color: '', colorCode: null, state: 'paired' }
      },
      {
        username: 'test4',
        name: '',
        surname: '',
        email: '',
        state: 'inTeam',
        wristband: { id: null, color: 'purple', colorCode: 2, state: 'unpaired' }
      }
    ],
    state: 'registered'
  }
#+end_src
**** DONE RUNNING PACKAGE Team
CLOSED: [2024-01-31 Wed 13:04]
***** Backend response
#+begin_src js
  {
    name: 'inspiring_Goldberry',
    totalPoints: 0,
    teamState: 'PACKAGE_RUNNING',
    created: 1706684656827,
    lastRegisterAttempt: null,
    currentRoster: {
      version: 1,
      players: [
        {
          username: 'Sauron_0h96h9q4xixv',
          wristbandNumber: 241,
          wristbandColor: 2
        },
        { username: 'ppone', wristbandNumber: 240, wristbandColor: 1 }
      ]
    },
    roomType: null,
    packages: [
      {
        id: 5,
        name: 'Per Time 90',
        cost: null,
        started: 1706685129723,
        ended: null,
        duration: 5400,
        paused: false,
        active: true
      }
    ]
  }
#+end_src
***** After Team.normalize()
#+begin_src js
  // Team.normalize(response, { depth: 2 })
  {
    name: 'inspiring_Goldberry',
    t_created: 1706684656827,
    points: 0,
    packages: [
      {
        id: 5,
        name: 'Per Time 90',
        type: 'time',
        amount: 90,
        cost: 0,
        t_start: 1706685129723,
        t_end: null,
        remainder: 0,
        state: 'playing'
      }
    ],
    roster: [
      {
        username: 'Sauron_0h96h9q4xixv',
        name: '',
        surname: '',
        email: '',
        state: 'playing',
        wristband: { id: 241, color: 'purple', colorCode: 2, state: 'paired' }
      },
      {
        username: 'ppone',
        name: '',
        surname: '',
        email: '',
        state: 'playing',
        wristband: { id: 240, color: 'red', colorCode: 1, state: 'paired' }
      }
    ],
    state: 'playing'
  }
#+end_src
**** DONE FINISHED Team
CLOSED: [2024-01-31 Wed 10:36]
