project.html
<li><a id="orgcab8650"></a>After Team.normalize()<br />
<div class="outline-text-6" id="text-1-19-4-1-2">
<div class="org-src-container">
<pre class="src src-js"><span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">Team.normalize(response, { depth: 2 });</span>
<span style="color: #4f97d7;">{</span>
  name: <span style="color: #2d9574;">'friendly_Eomer_c3d'</span>,
  t_created: <span style="color: #a45bad;">1706472198904</span>,
  points: <span style="color: #a45bad;">0</span>,
  packages: <span style="color: #bc6ec5;">[</span>
    <span style="color: #2d9574;">{</span>
      id: <span style="color: #a45bad;">1</span>,
      name: <span style="color: #2d9574;">'Per Mission 5'</span>,
      type: <span style="color: #2d9574;">'mission'</span>,
      amount: <span style="color: #a45bad;">5</span>,
      cost: <span style="color: #a45bad;">0</span>,
      t_start: <span style="color: #a45bad;">null</span>,
      t_end: <span style="color: #a45bad;">null</span>,
      remainder: <span style="color: #a45bad;">5</span>,
      state: <span style="color: #2d9574;">'registered'</span>
    <span style="color: #2d9574;">}</span>,
    <span style="color: #2d9574;">{</span>
      id: <span style="color: #a45bad;">2</span>,
      name: <span style="color: #2d9574;">'Per Mission 10'</span>,
      type: <span style="color: #2d9574;">'mission'</span>,
      amount: <span style="color: #a45bad;">10</span>,
      cost: <span style="color: #a45bad;">0</span>,
      t_start: <span style="color: #a45bad;">1706686189153</span>,
      t_end: <span style="color: #a45bad;">null</span>,
      remainder: <span style="color: #a45bad;">5</span>,
      state: <span style="color: #2d9574;">'playing'</span>
    <span style="color: #2d9574;">}</span>,
    <span style="color: #2d9574;">{</span>
      id: <span style="color: #a45bad;">3</span>,
      name: <span style="color: #2d9574;">'Per Mission 20'</span>,
      type: <span style="color: #2d9574;">'mission'</span>,
      amount: <span style="color: #a45bad;">20</span>,
      cost: <span style="color: #a45bad;">0</span>,
      t_start: <span style="color: #a45bad;">1706686189153</span>,
      t_end: <span style="color: #a45bad;">1706686199999</span>,
      remainder: <span style="color: #a45bad;">0</span>,
      state: <span style="color: #2d9574;">'completed'</span>
    <span style="color: #2d9574;">}</span>,
    <span style="color: #2d9574;">{</span>
      id: <span style="color: #a45bad;">8</span>,
      name: <span style="color: #2d9574;">'Per Time 30'</span>,
      type: <span style="color: #2d9574;">'time'</span>,
      amount: <span style="color: #a45bad;">30</span>,
      cost: <span style="color: #a45bad;">0</span>,
      t_start: <span style="color: #a45bad;">null</span>,
      t_end: <span style="color: #a45bad;">null</span>,
      remainder: <span style="color: #a45bad;">0</span>,
      state: <span style="color: #2d9574;">'registered'</span>
    <span style="color: #2d9574;">}</span>,
    <span style="color: #2d9574;">{</span>
      id: <span style="color: #a45bad;">5</span>,
      name: <span style="color: #2d9574;">'Per Time 60'</span>,
      type: <span style="color: #2d9574;">'time'</span>,
      amount: <span style="color: #a45bad;">90</span>,
      cost: <span style="color: #a45bad;">0</span>,
      t_start: <span style="color: #a45bad;">1706685129723</span>,
      t_end: <span style="color: #a45bad;">null</span>,
      remainder: <span style="color: #a45bad;">1673540</span>,
      state: <span style="color: #2d9574;">'playing'</span>
    <span style="color: #2d9574;">}</span>,
    <span style="color: #2d9574;">{</span>
      id: <span style="color: #a45bad;">3</span>,
      name: <span style="color: #2d9574;">'Per Time 90'</span>,
      type: <span style="color: #2d9574;">'time'</span>,
      amount: <span style="color: #a45bad;">30</span>,
      cost: <span style="color: #a45bad;">0</span>,
      t_start: <span style="color: #a45bad;">1706473426225</span>,
      t_end: <span style="color: #a45bad;">1706478843795</span>,
      remainder: <span style="color: #a45bad;">0</span>,
      state: <span style="color: #2d9574;">'completed'</span>
    <span style="color: #2d9574;">}</span>
  <span style="color: #bc6ec5;">]</span>,
  roster: <span style="color: #bc6ec5;">[</span>
    <span style="color: #2d9574;">{</span>
      username: <span style="color: #2d9574;">'test1'</span>,
      name: <span style="color: #2d9574;">''</span>,
      surname: <span style="color: #2d9574;">''</span>,
      email: <span style="color: #2d9574;">''</span>,
      state: <span style="color: #2d9574;">'inTeam'</span>,
      wristband: <span style="color: #67b11d;">{</span> id: <span style="color: #a45bad;">null</span>, color: <span style="color: #2d9574;">''</span>, colorCode: <span style="color: #a45bad;">null</span>, state: <span style="color: #2d9574;">'unpaired'</span> <span style="color: #67b11d;">}</span>
    <span style="color: #2d9574;">}</span>,
    <span style="color: #2d9574;">{</span>
      username: <span style="color: #2d9574;">'test2'</span>,
      name: <span style="color: #2d9574;">''</span>,
      surname: <span style="color: #2d9574;">''</span>,
      email: <span style="color: #2d9574;">''</span>,
      state: <span style="color: #2d9574;">'inTeam'</span>,
      wristband: <span style="color: #67b11d;">{</span> id: <span style="color: #a45bad;">1</span>, color: <span style="color: #2d9574;">'purple'</span>, colorCode: <span style="color: #a45bad;">2</span>, state: <span style="color: #2d9574;">'paired'</span> <span style="color: #67b11d;">}</span>
    <span style="color: #2d9574;">}</span>,
    <span style="color: #2d9574;">{</span>
      username: <span style="color: #2d9574;">'test3'</span>,
      name: <span style="color: #2d9574;">''</span>,
      surname: <span style="color: #2d9574;">''</span>,
      email: <span style="color: #2d9574;">''</span>,
      state: <span style="color: #2d9574;">'inTeam'</span>,
      wristband: <span style="color: #67b11d;">{</span> id: <span style="color: #a45bad;">1</span>, color: <span style="color: #2d9574;">''</span>, colorCode: <span style="color: #a45bad;">null</span>, state: <span style="color: #2d9574;">'paired'</span> <span style="color: #67b11d;">}</span>
    <span style="color: #2d9574;">}</span>,
    <span style="color: #2d9574;">{</span>
      username: <span style="color: #2d9574;">'test4'</span>,
      name: <span style="color: #2d9574;">''</span>,
      surname: <span style="color: #2d9574;">''</span>,
      email: <span style="color: #2d9574;">''</span>,
      state: <span style="color: #2d9574;">'inTeam'</span>,
      wristband: <span style="color: #67b11d;">{</span> id: <span style="color: #a45bad;">null</span>, color: <span style="color: #2d9574;">'purple'</span>, colorCode: <span style="color: #a45bad;">2</span>, state: <span style="color: #2d9574;">'unpaired'</span> <span style="color: #67b11d;">}</span>
    <span style="color: #2d9574;">}</span>
  <span style="color: #bc6ec5;">]</span>,
  state: <span style="color: #2d9574;">'registered'</span>
<span style="color: #4f97d7;">}</span>
</pre>
</div>
</div>
</li>
</ol>
</li>
<li><a id="orge93bbad"></a>Two with a RUNNING PACKAGE<br />
<div class="outline-text-5" id="text-1-19-4-2">
<div class="org-src-container">
<pre class="src src-js"><span style="color: #4f97d7;">{</span>
  name: <span style="color: #2d9574;">'inspiring_Goldberry'</span>,
  totalPoints: <span style="color: #a45bad;">0</span>,
  teamState: <span style="color: #2d9574;">'PACKAGE_RUNNING'</span>,
  created: <span style="color: #a45bad;">1706684656827</span>,
  lastRegisterAttempt: <span style="color: #a45bad;">null</span>,
  currentRoster: <span style="color: #bc6ec5;">{</span>
    version: <span style="color: #a45bad;">1</span>,
    players: <span style="color: #2d9574;">[</span>
      <span style="color: #67b11d;">{</span>
        username: <span style="color: #2d9574;">'Sauron_0h96h9q4xixv'</span>,
        wristbandNumber: <span style="color: #a45bad;">241</span>,
        wristbandColor: <span style="color: #a45bad;">2</span>
      <span style="color: #67b11d;">}</span>,
      <span style="color: #67b11d;">{</span> username: <span style="color: #2d9574;">'ppone'</span>, wristbandNumber: <span style="color: #a45bad;">240</span>, wristbandColor: <span style="color: #a45bad;">1</span> <span style="color: #67b11d;">}</span>
    <span style="color: #2d9574;">]</span>
  <span style="color: #bc6ec5;">}</span>,
  roomType: <span style="color: #a45bad;">null</span>,
  packages: <span style="color: #bc6ec5;">[</span>
    <span style="color: #2d9574;">{</span>
      id: <span style="color: #a45bad;">5</span>,
      name: <span style="color: #2d9574;">'Per Time 90'</span>,
      cost: <span style="color: #a45bad;">null</span>,
      started: <span style="color: #a45bad;">1706685129723</span>,
      ended: <span style="color: #a45bad;">null</span>,
      duration: <span style="color: #a45bad;">5400</span>,
      paused: <span style="color: #a45bad;">false</span>,
      active: <span style="color: #a45bad;">true</span>
    <span style="color: #2d9574;">}</span>
  <span style="color: #bc6ec5;">]</span>
<span style="color: #4f97d7;">}</span>,
<span style="color: #4f97d7;">{</span>
  name: <span style="color: #2d9574;">'team19'</span>,
  totalPoints: <span style="color: #a45bad;">0</span>,
  teamState: <span style="color: #2d9574;">'PACKAGE_RUNNING'</span>,
  created: <span style="color: #a45bad;">1702243704982</span>,
  lastRegisterAttempt: <span style="color: #a45bad;">null</span>,
  currentRoster: <span style="color: #bc6ec5;">{</span>
    version: <span style="color: #a45bad;">null</span>,
    players: <span style="color: #2d9574;">[</span>
      <span style="color: #67b11d;">{</span>
        username: <span style="color: #2d9574;">'PP191'</span>,
        wristbandNumber: <span style="color: #a45bad;">null</span>,
        wristbandColor: <span style="color: #a45bad;">null</span>
      <span style="color: #67b11d;">}</span>,
      <span style="color: #67b11d;">{</span>
        username: <span style="color: #2d9574;">'PP190'</span>,
        wristbandNumber: <span style="color: #a45bad;">null</span>,
        wristbandColor: <span style="color: #a45bad;">null</span>
      <span style="color: #67b11d;">}</span>
    <span style="color: #2d9574;">]</span>
  <span style="color: #bc6ec5;">}</span>,
  roomType: <span style="color: #a45bad;">null</span>,
  packages: <span style="color: #bc6ec5;">[]</span>
<span style="color: #4f97d7;">}</span>,
</pre>
</div>
</div>
</li>
