project.org
***** Backend response
#+begin_src js
    {
    name: 'friendly_Eomer_c3d',
    totalPoints: 0,
    teamState: 'FINISHED',
    created: 1706472198904,
    lastRegisterAttempt: null,
    currentRoster: {
      version: 1,
      players: [
        {
          username: '0a5sh6llqf3v',
          wristbandNumber: null,
          wristbandColor: null
        },
        {
          username: '3q0vtxg1o7s',
          wristbandNumber: null,
          wristbandColor: null
        }
      ]
    },
    roomType: null,
    packages: [
      {
        id: 1,
        name: 'Per Mission 10',
        cost: null,
        started: 1706472302416,
        ended: 1706475903814,
        missions: 10,
        missionsPlayed: 0,
        active: false
      }
    ]
  }
#+end_src
***** After Team.normalize()
#+begin_src js
  // Team.normalize(response, { depth: 2 });
  {
    name: 'friendly_Eomer_c3d',
    t_created: 1706472198904,
    points: 0,
    packages: [
      {
        id: 1,
        name: 'Per Mission 10',
        type: 'mission',
        amount: 10,
        cost: 0,
        t_start: 1706472302416,
        t_end: 1706475903814,
        remainder: 10,
        state: 'completed'
      }
    ],
    roster: [
      {
        username: '0a5sh6llqf3v',
        name: '',
        surname: '',
        email: '',
        state: 'inTeam',
        wristband: { id: null, color: '', colorCode: null, state: 'unpaired' }
      },
      {
        username: '3q0vtxg1o7s',
        name: '',
        surname: '',
        email: '',
        state: 'inTeam',
        wristband: { id: null, color: '', colorCode: null, state: 'unpaired' }
      }
    ],
    state: 'registered'
  }
#+end_src
**** DONE PENDING PACKAGE Team
CLOSED: [2024-01-31 Wed 10:26]
***** Backend response
#+begin_src js
  {
  name: 'inspiring_Goldberry',
  totalPoints: 0,
  teamState: 'PENDING_PACKAGES',
  created: 1706684656827,
  lastRegisterAttempt: null,
  currentRoster: {
    version: 1,
    players: [
      { username: 'ppone', wristbandNumber: 240, wristbandColor: 1 },
      {
        username: 'Sauron_0h96h9q4xixv',
        wristbandNumber: 241,
        wristbandColor: 2
      }
    ]
  },
  roomType: null,
  packages: []
}
#+end_src
***** After Team.normalize()
#+begin_src js
  // Team.normalize(response, { depth: 2 });
  {
    name: 'inspiring_Goldberry',
    t_created: 1706684656827,
    points: 0,
    packages: [],
    roster: [
      {
        username: 'ppone',
        name: '',
        surname: '',
        email: '',
        state: 'inTeam',
        wristband: { id: 240, color: 'red', colorCode: 1, state: 'paired' }
      },
      {
        username: 'Sauron_0h96h9q4xixv',
        name: '',
        surname: '',
        email: '',
        state: 'inTeam',
        wristband: { id: 241, color: 'purple', colorCode: 2, state: 'paired' }
      }
    ],
    state: 'registered'
  }
#+end_src
**** DONE LOADED PACKAGE Team
CLOSED: [2024-01-31 Wed 10:27]
***** Backend response
#+begin_src js
    {
    name: 'inspiring_Goldberry',
    totalPoints: 0,
    teamState: 'LOADED_PACKAGES',
    created: 1706684656827,
    lastRegisterAttempt: null,
    currentRoster: {
      version: 1,
      players: [
        {
          username: 'Sauron_0h96h9q4xixv',
          wristbandNumber: 241,
          wristbandColor: 2
        },
        { username: 'ppone', wristbandNumber: 240, wristbandColor: 1 }
      ]
    },
    roomType: null,
    packages: [
      {
        id: 4,
        name: 'Per Mission 20',
        cost: null,
        started: null,
        ended: null,
        missions: 20,
        missionsPlayed: 0,
        active: false
      },
    ]
  }
#+end_src
***** After Team.normalize()
#+begin_src js
  // Team.normalize(response, { depth: 2 });
  {
    name: 'inspiring_Goldberry',
    t_created: 1706684656827,
    points: 0,
    packages: [
      {
        id: 4,
        name: 'Per Mission 20',
        type: 'mission',
        amount: 20,
        cost: 0,
        t_start: null,
        t_end: null,
        remainder: 20,
        state: 'registered'
      }
    ],
    roster: [
      {
        username: 'Sauron_0h96h9q4xixv',
        name: '',
        surname: '',
        email: '',
        state: 'inTeam',
        wristband: { id: 241, color: 'purple', colorCode: 2, state: 'paired' }
      },
      {
        username: 'ppone',
        name: '',
        surname: '',
        email: '',
        state: 'inTeam',
        wristband: { id: 240, color: 'red', colorCode: 1, state: 'paired' }
      }
    ],
    state: 'registered'
  }
#+end_src
*** DONE Verify Team.normalize()
CLOSED: [2024-01-31 Wed 15:09]
