project.html
<li><a id="orgc3d7770"></a>One that has a FINISHED PACKAGE<br />
<div class="outline-text-5" id="text-1-19-4-3">
<div class="org-src-container">
<pre class="src src-js">  <span style="color: #4f97d7;">{</span>
  name: <span style="color: #2d9574;">'friendly_Eomer_c3d'</span>,
  totalPoints: <span style="color: #a45bad;">0</span>,
  teamState: <span style="color: #2d9574;">'FINISHED'</span>,
  created: <span style="color: #a45bad;">1706472198904</span>,
  lastRegisterAttempt: <span style="color: #a45bad;">null</span>,
  currentRoster: <span style="color: #bc6ec5;">{</span>
    version: <span style="color: #a45bad;">1</span>,
    players: <span style="color: #2d9574;">[</span>
      <span style="color: #67b11d;">{</span>
        username: <span style="color: #2d9574;">'0a5sh6llqf3v'</span>,
        wristbandNumber: <span style="color: #a45bad;">null</span>,
        wristbandColor: <span style="color: #a45bad;">null</span>
      <span style="color: #67b11d;">}</span>,
      <span style="color: #67b11d;">{</span>
        username: <span style="color: #2d9574;">'3q0vtxg1o7s'</span>,
        wristbandNumber: <span style="color: #a45bad;">null</span>,
        wristbandColor: <span style="color: #a45bad;">null</span>
      <span style="color: #67b11d;">}</span>
    <span style="color: #2d9574;">]</span>
  <span style="color: #bc6ec5;">}</span>,
  roomType: <span style="color: #a45bad;">null</span>,
  packages: <span style="color: #bc6ec5;">[</span>
    <span style="color: #2d9574;">{</span>
      id: <span style="color: #a45bad;">1</span>,
      name: <span style="color: #2d9574;">'Per Mission 10'</span>,
      cost: <span style="color: #a45bad;">null</span>,
      started: <span style="color: #a45bad;">1706472302416</span>,
      ended: <span style="color: #a45bad;">1706475903814</span>,
      missions: <span style="color: #a45bad;">10</span>,
      missionsPlayed: <span style="color: #a45bad;">0</span>,
      active: <span style="color: #a45bad;">false</span>
    <span style="color: #2d9574;">}</span>
  <span style="color: #bc6ec5;">]</span>
<span style="color: #4f97d7;">}</span>
</pre>
</div>
</div>
</li>
<li><a id="orgf3ce8da"></a>One that has a PENDING PACKAGE<br />
<ol class="org-ol">
<li><a id="org09f6fea"></a>Backend response<br />
<div class="outline-text-6" id="text-1-19-4-4-1">
<div class="org-src-container">
<pre class="src src-js">  <span style="color: #4f97d7;">{</span>
  name: <span style="color: #2d9574;">'inspiring_Goldberry'</span>,
  totalPoints: <span style="color: #a45bad;">0</span>,
  teamState: <span style="color: #2d9574;">'PENDING_PACKAGES'</span>,
  created: <span style="color: #a45bad;">1706684656827</span>,
  lastRegisterAttempt: <span style="color: #a45bad;">null</span>,
  currentRoster: <span style="color: #bc6ec5;">{</span>
    version: <span style="color: #a45bad;">1</span>,
    players: <span style="color: #2d9574;">[</span>
      <span style="color: #67b11d;">{</span> username: <span style="color: #2d9574;">'ppone'</span>, wristbandNumber: <span style="color: #a45bad;">240</span>, wristbandColor: <span style="color: #a45bad;">1</span> <span style="color: #67b11d;">}</span>,
      <span style="color: #67b11d;">{</span>
        username: <span style="color: #2d9574;">'Sauron_0h96h9q4xixv'</span>,
        wristbandNumber: <span style="color: #a45bad;">241</span>,
        wristbandColor: <span style="color: #a45bad;">2</span>
      <span style="color: #67b11d;">}</span>
    <span style="color: #2d9574;">]</span>
  <span style="color: #bc6ec5;">}</span>,
  roomType: <span style="color: #a45bad;">null</span>,
  packages: <span style="color: #bc6ec5;">[]</span>
<span style="color: #4f97d7;">}</span>
</pre>
</div>
</div>
</li>
<li><a id="orgd3ed9f5"></a>After Team.normalize()<br />
<div class="outline-text-6" id="text-1-19-4-4-2">
<div class="org-src-container">
<pre class="src src-js"><span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">Team.normalize(response, { depth: 2 });</span>
<span style="color: #4f97d7;">{</span>
  name: <span style="color: #2d9574;">'inspiring_Goldberry'</span>,
  t_created: <span style="color: #a45bad;">1706684656827</span>,
  points: <span style="color: #a45bad;">0</span>,
  packages: <span style="color: #bc6ec5;">[]</span>,
  roster: <span style="color: #bc6ec5;">[</span>
    <span style="color: #2d9574;">{</span>
      username: <span style="color: #2d9574;">'ppone'</span>,
      name: <span style="color: #2d9574;">''</span>,
      surname: <span style="color: #2d9574;">''</span>,
      email: <span style="color: #2d9574;">''</span>,
      state: <span style="color: #2d9574;">'inTeam'</span>,
      wristband: <span style="color: #67b11d;">{</span> id: <span style="color: #a45bad;">240</span>, color: <span style="color: #2d9574;">'red'</span>, colorCode: <span style="color: #a45bad;">1</span>, state: <span style="color: #2d9574;">'paired'</span> <span style="color: #67b11d;">}</span>
    <span style="color: #2d9574;">}</span>,
    <span style="color: #2d9574;">{</span>
      username: <span style="color: #2d9574;">'Sauron_0h96h9q4xixv'</span>,
      name: <span style="color: #2d9574;">''</span>,
      surname: <span style="color: #2d9574;">''</span>,
      email: <span style="color: #2d9574;">''</span>,
      state: <span style="color: #2d9574;">'inTeam'</span>,
      wristband: <span style="color: #67b11d;">{</span> id: <span style="color: #a45bad;">241</span>, color: <span style="color: #2d9574;">'purple'</span>, colorCode: <span style="color: #a45bad;">2</span>, state: <span style="color: #2d9574;">'paired'</span> <span style="color: #67b11d;">}</span>
    <span style="color: #2d9574;">}</span>
  <span style="color: #bc6ec5;">]</span>,
  state: <span style="color: #2d9574;">'registered'</span>
<span style="color: #4f97d7;">}</span>
</pre>
</div>
</div>
</li>
</ol>
</li>
<li><a id="orgd8e576b"></a>One that has a LOADED PACKAGE<br />
<div class="outline-text-5" id="text-1-19-4-5">
<div class="org-src-container">
<pre class="src src-js">  <span style="color: #4f97d7;">{</span>
  name: <span style="color: #2d9574;">'inspiring_Goldberry'</span>,
  totalPoints: <span style="color: #a45bad;">0</span>,
  teamState: <span style="color: #2d9574;">'LOADED_PACKAGES'</span>,
  created: <span style="color: #a45bad;">1706684656827</span>,
  lastRegisterAttempt: <span style="color: #a45bad;">null</span>,
  currentRoster: <span style="color: #bc6ec5;">{</span>
    version: <span style="color: #a45bad;">1</span>,
    players: <span style="color: #2d9574;">[</span>
      <span style="color: #67b11d;">{</span>
        username: <span style="color: #2d9574;">'Sauron_0h96h9q4xixv'</span>,
        wristbandNumber: <span style="color: #a45bad;">241</span>,
        wristbandColor: <span style="color: #a45bad;">2</span>
      <span style="color: #67b11d;">}</span>,
      <span style="color: #67b11d;">{</span> username: <span style="color: #2d9574;">'ppone'</span>, wristbandNumber: <span style="color: #a45bad;">240</span>, wristbandColor: <span style="color: #a45bad;">1</span> <span style="color: #67b11d;">}</span>
    <span style="color: #2d9574;">]</span>
  <span style="color: #bc6ec5;">}</span>,
  roomType: <span style="color: #a45bad;">null</span>,
  packages: <span style="color: #bc6ec5;">[</span>
    <span style="color: #2d9574;">{</span>
      id: <span style="color: #a45bad;">4</span>,
      name: <span style="color: #2d9574;">'Per Mission 20'</span>,
      cost: <span style="color: #a45bad;">null</span>,
      started: <span style="color: #a45bad;">null</span>,
      ended: <span style="color: #a45bad;">null</span>,
      missions: <span style="color: #a45bad;">20</span>,
      missionsPlayed: <span style="color: #a45bad;">0</span>,
      active: <span style="color: #a45bad;">false</span>
    <span style="color: #2d9574;">}</span>,
  <span style="color: #bc6ec5;">]</span>
<span style="color: #4f97d7;">}</span>
</pre>
</div>
</div>
</li>
</ol>
</div>
