project.org
* Communication between objects
The *afmachine* acts as the *Invoker* in the *Command* pattern. It is the
control center of the application. All actions that touch multiple modules of
the system are managed and directed towards those systems by the control center.

A command is an action that has to be carried out at some point in the future.
Each command may be comprised of multiple subtasks that need to be performed,
where order is important just like in the middleware pattern. Eeach subtask adds
or performs some kind of processing to the context passed along. When all
subtasks are finished the command is considered settled, (to borrow a promise
term) and interested parties are notified.

All entities that initiate commands are *clients* to the afmachine. It is rather
common for a client, to also be a target of the command; albeit at a later stage
of the command's lifecycle.

The modules that are supposed to process the command are the *targets* of the
command.

The management, monitoring and guidance of a command from its inception to its
end is handled by the afmachine. Specifically, clients do not initiate commands,
rather, they ask afmachine to do that for them.

Commands are composed of a queue of tasks that need to be executed. Each task is
intended to be consumed by a target.

* Afmachine

The Afmachine or afm for short is the control center of the application. It is a
singleton object. All browser windows and tabs share the SAME object.

All entities such as:

- the Player, Team..., ...Package
- A React Component
- The Administrator interacting with the application by clicking on buttons etc

make use of the afm API and are collectively known as clients. The afm API
is accessed through methods of the afm singleton object.

A standard interaction between a client and afm might go as follows:

- A client initiates an event through the use of a React component such as by
  clicking on a button.
  
- The React component invokes an API method of afm.
  
- Afm instantiates a Command
  
  The instance is returned synchronously.

  Each method of Afm represents some kind of Task such as logging in the
  administrator or pairing a Wristband. These tasks are defined at application
  initialization time. A Command represents an instance of running the Task.

  Some tasks return promises other tasks accept callbacks. If the Task is
  is designed to be called through an Entity usually expected to be called through an Entity it

- Afm enqueues the new Command.
  
  If the queue is empty the Command is immediately invoked. Otherwise it waits for its turn.
  
- Afm returns a Promise that will be fulfilled with the fulfillment value of the
  Command.
  
- Afm emits various events such as:

  onNewCommand
  commandStart

* Small core afm

creates commands
combines precmd postcmd pretask postask at the time of a Commands creation.
queues the command.
runs the command queue.



precommand


try {

try {
task()
targetCb(task);
} catch (err) {
targetCb(task)
}

task.onSuccess();

} catch (err) {

task.onFailure();

}

postask
}

precommand

* Afmachine new

The *afmachine* or *afm* for short is the control center of the application. It
is a singleton object. All browser windows and tabs share the same instance.

It's API is consumed by invoking any of the public methods of the *afm*
instance.

All API calls are stored under the directory:

/src/afmachine/tasks/*

Each of the statically defined API calls is a *Task*.

The primary function of *Afmachine* is to allow clients (such as a React
component or the UI in general) to build middleware chains around each Task.
This design model follows loosely the *command* design pattern. see
(https://en.wikipedia.org/wiki/Command_pattern)

Each time an API call is made *afm* creates a *Command* for the invoked *Task*.
A *Command* represents one instance of a running *Task*.

For example: If a client was to invoke an API call multiple times:

afm.listPkgs()
afm.listPkgs()
afm.listPkgs()

There would be 3 *Commands* created for the listPkgs *Task*.

Each *Command* carries with it a lot of information but fundamentally it
contains a sequence of functions (the middleware chain).

When a command is created it is placed into a queue by afm. The afm is
responsible for invoking each the commands in the queue in sequence (meaning in
order, waiting for the completion of one to carry on with the next).

For example: If a client was to invoke the API calls:

afm.loginCashier();
afm.listPkgs();
afm.logoutCashier();

There would be 3 *Commands* to run in the queue by *afm*.
It would proceed by running them in these order:

1. loginCashier()
2. listPkgs()
3. logoutCashier()

While each Command does run in order; an Error will not block the execution of
the next Command. Each Command is independent of the result of the previous one
unless the previous Command threw an unexpected Error in which case afm breaks
the chain of Commands or one of the hooks operating at the Command level
breaks the chain (more on that later).

Clients to afm can register functions that become part of a Command at either
the Task level or the Command level called hooks. Each hook must implement the
same signature.

function hook (context, next) {};

Command level hooks are provided with the afm instance as context.
Registering a Command level hook is done through the afm.on() method.

For exmaple:

// Register a hook to run before each command in the queue.
afm.on('precmd', (afm, next) => {});

// Register a hook to run after each command in the queue.
afm.on('postcmd', (afm, next) => {});

A Command level hook may interrupt the command sequence by not calling next();

Task level hooks are provided with the Command as context. (The Command also has
an afm property that is a reference to the afm instance). Registering a Task
level hook is done through the afm[$task].on() method.

For example:

// Register a hook to run before each Command for the listPkgs Task.
afm.listPkgs.on('precmd', (command, next) => {});

// Register a hook to run after each Command for the listPkgs Task.
afm.listPkgs.on('postcmd', (command, next) => {});

A Task level hook may interrupt the task sequence by not calling next(); The
task sequence is composed of:

The precmd Task level hooks + Task + postcmd Task level hooks

** Command
