project.html
<div id="outline-container-org27b5e3f" class="outline-4">
<h4 id="org27b5e3f"><span class="section-number-4">1.19.5.</span> Backend response</h4>
<div class="outline-text-4" id="text-1-19-5">
<div class="org-src-container">
<pre class="src src-js"><span style="color: #4f97d7; font-weight: bold;">const</span> <span style="color: #7590db;">response</span> = <span style="color: #4f97d7;">{</span>
  timestamp: <span style="color: #a45bad;">1706685352965</span>,
  result: <span style="color: #2d9574;">"OK"</span>,
  teams: <span style="color: #bc6ec5;">[</span>

  <span style="color: #bc6ec5;">]</span>,
<span style="color: #4f97d7;">}</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org6fb04da" class="outline-4">
<h4 id="org6fb04da"><span class="section-number-4">1.19.6.</span> <span class="todo TODO">TODO</span> Verify Team.normalize()</h4>
</div>
</div>
</div>
<div id="outline-container-orga136af7" class="outline-2">
<h2 id="orga136af7"><span class="section-number-2">2.</span> Communication between objects</h2>
<div class="outline-text-2" id="text-2">
<p>
The <b>afmachine</b> acts as the <b>Invoker</b> in the <b>Command</b> pattern. It is the
control center of the application. All actions that touch multiple modules of
the system are managed and directed towards those systems by the control center.
</p>

<p>
A command is an action that has to be carried out at some point in the future.
Each command may be comprised of multiple subtasks that need to be performed,
where order is important just like in the middleware pattern. Eeach subtask adds
or performs some kind of processing to the context passed along. When all
subtasks are finished the command is considered settled, (to borrow a promise
term) and interested parties are notified.
</p>

<p>
All entities that initiate commands are <b>clients</b> to the afmachine. It is rather
common for a client, to also be a target of the command; albeit at a later stage
of the command's lifecycle.
</p>

<p>
The modules that are supposed to process the command are the <b>targets</b> of the
command.
</p>

<p>
The management, monitoring and guidance of a command from its inception to its
end is handled by the afmachine. Specifically, clients do not initiate commands,
rather, they ask afmachine to do that for them.
</p>

<p>
Commands are composed of a queue of tasks that need to be executed. Each task is
intended to be consumed by a target.
</p>
</div>
</div>

<div id="outline-container-org3be503e" class="outline-2">
<h2 id="org3be503e"><span class="section-number-2">3.</span> Afmachine</h2>
<div class="outline-text-2" id="text-3">
<p>
The Afmachine or afm for short is the control center of the application. It is a
singleton object. All browser windows and tabs share the SAME object.
</p>

<p>
All entities such as:
</p>

<ul class="org-ul">
<li>the Player, Team&#x2026;, &#x2026;Package</li>
<li>A React Component</li>
<li>The Administrator interacting with the application by clicking on buttons etc</li>
</ul>

<p>
make use of the afm API and are collectively known as clients. The afm API
is accessed through methods of the afm singleton object.
</p>

<p>
A standard interaction between a client and afm might go as follows:
</p>

<ul class="org-ul">
<li>A client initiates an event through the use of a React component such as by
clicking on a button.</li>

<li>The React component invokes an API method of afm.</li>

<li><p>
Afm instantiates a Command
</p>

<p>
The instance is returned synchronously.
</p>

<p>
Each method of Afm represents some kind of Task such as logging in the
administrator or pairing a Wristband. These tasks are defined at application
initialization time. A Command represents an instance of running the Task.
</p>

<p>
Some tasks return promises other tasks accept callbacks. If the Task is
is designed to be called through an Entity usually expected to be called through an Entity it
</p></li>

<li><p>
Afm enqueues the new Command.
</p>

<p>
If the queue is empty the Command is immediately invoked. Otherwise it waits for its turn.
</p></li>

<li>Afm returns a Promise that will be fulfilled with the fulfillment value of the
Command.</li>

<li><p>
Afm emits various events such as:
</p>

<p>
onNewCommand
commandStart
</p></li>
</ul>
</div>
</div>

<div id="outline-container-org1b0a309" class="outline-2">
<h2 id="org1b0a309"><span class="section-number-2">4.</span> Small core afm</h2>
<div class="outline-text-2" id="text-4">
<p>
creates commands
combines precmd postcmd pretask postask at the time of a Commands creation.
queues the command.
runs the command queue.
</p>



<p>
precommand
</p>


<p>
try {
</p>

<p>
try {
task()
targetCb(task);
} catch (err) {
targetCb(task)
}
</p>

<p>
task.onSuccess();
</p>

<p>
} catch (err) {
</p>

<p>
task.onFailure();
</p>

<p>
}
</p>

<p>
postask
}
</p>

<p>
precommand
</p>
</div>
</div>

<div id="outline-container-org4642f0f" class="outline-2">
<h2 id="org4642f0f"><span class="section-number-2">5.</span> Afmachine new</h2>
<div class="outline-text-2" id="text-5">
<p>
The <b>afmachine</b> or <b>afm</b> for short is the control center of the application. It
is a singleton object. All browser windows and tabs share the same instance.
</p>

<p>
It's API is consumed by invoking any of the public methods of the <b>afm</b>
instance.
</p>

<p>
All API calls are stored under the directory:
</p>

<p>
/src/afmachine/tasks/*
</p>

<p>
Each of the statically defined API calls is a <b>Task</b>.
</p>

<p>
The primary function of <b>Afmachine</b> is to allow clients (such as a React
component or the UI in general) to build middleware chains around each Task.
This design model follows loosely the <b>command</b> design pattern. see
(<a href="https://en.wikipedia.org/wiki/Command_pattern">https://en.wikipedia.org/wiki/Command_pattern</a>)
</p>

<p>
Each time an API call is made <b>afm</b> creates a <b>Command</b> for the invoked <b>Task</b>.
A <b>Command</b> represents one instance of a running <b>Task</b>.
</p>

<p>
For example: If a client was to invoke an API call multiple times:
</p>

<p>
afm.listPkgs()
afm.listPkgs()
afm.listPkgs()
</p>

<p>
There would be 3 <b>Commands</b> created for the listPkgs <b>Task</b>.
</p>

<p>
Each <b>Command</b> carries with it a lot of information but fundamentally it
contains a sequence of functions (the middleware chain).
</p>

<p>
When a command is created it is placed into a queue by afm. The afm is
responsible for invoking each the commands in the queue in sequence (meaning in
order, waiting for the completion of one to carry on with the next).
</p>

<p>
For example: If a client was to invoke the API calls:
</p>

<p>
afm.loginCashier();
afm.listPkgs();
afm.logoutCashier();
</p>

<p>
There would be 3 <b>Commands</b> to run in the queue by <b>afm</b>.
It would proceed by running them in these order:
</p>

<ol class="org-ol">
<li>loginCashier()</li>
<li>listPkgs()</li>
<li>logoutCashier()</li>
</ol>

<p>
While each Command does run in order; an Error will not block the execution of
the next Command. Each Command is independent of the result of the previous one
unless the previous Command threw an unexpected Error in which case afm breaks
the chain of Commands or one of the hooks operating at the Command level
breaks the chain (more on that later).
</p>

<p>
Clients to afm can register functions that become part of a Command at either
the Task level or the Command level called hooks. Each hook must implement the
same signature.
</p>

<p>
function hook (context, next) {};
</p>

<p>
Command level hooks are provided with the afm instance as context.
Registering a Command level hook is done through the afm.on() method.
</p>

<p>
For exmaple:
</p>

<p>
// Register a hook to run before each command in the queue.
afm.on('precmd', (afm, next) =&gt; {});
</p>

<p>
// Register a hook to run after each command in the queue.
afm.on('postcmd', (afm, next) =&gt; {});
</p>

<p>
A Command level hook may interrupt the command sequence by not calling next();
</p>

<p>
Task level hooks are provided with the Command as context. (The Command also has
an afm property that is a reference to the afm instance). Registering a Task
level hook is done through the afm[$task].on() method.
</p>

<p>
For example:
</p>

<p>
// Register a hook to run before each Command for the listPkgs Task.
afm.listPkgs.on('precmd', (command, next) =&gt; {});
</p>

<p>
// Register a hook to run after each Command for the listPkgs Task.
afm.listPkgs.on('postcmd', (command, next) =&gt; {});
</p>

<p>
A Task level hook may interrupt the task sequence by not calling next(); The
task sequence is composed of:
</p>

<p>
The precmd Task level hooks + Task + postcmd Task level hooks
</p>
</div>
