project.org
** Difference between events and hooks
A hook is a middleware function that becomes part of each Command. It is invoked
in the order it appears within the Command or Task sequence. As such it has no
control over its execution. It may never run because some previous hook
aborted the sequence.

Events on the other hand are not part any sequence. As such their handlers will
be invoked regardless of the sequnce itself.
** Invoking tasks (creating commands)
** Error handling

* Command Targets
Command Targets should not need to know if a command was aborted or not.
Command targets are notified through CALLBACKS not Promises.

A callback interface is used to prevent dangling promises.
In case a command is aborted or an error occurs in the application level the
callback shall never be called.

* Tasks
** List packages

* User stories
** Administrator toggles wristband pairing mode
In order for the administrator to be able to toggle a wristbands pairing mode
the following components are required:

UI component that handles a user click
A Player instance

The player hook is a wrapper to the Player class. The hook exposes the player's
interface to


* AFM Command pattern

target: entities
command: afm.task();
invoker: afm
client: UI, React Component


entities register through afm.



* <2024-01-24 Wed>
** Entities as the Command initializers
The Commander entities initiate commands.

Afm caches the Player that initiated a Command for a Task.
Afm creates a Command out of the Task.


The task middleware sequence contains:

Player.task
...middleware
Player.taskCompleted


*** The caches
A Map is used to contain each of the command initiating entities such as:

- player
- team
- wristband


Map.get('entityId')
Map.set('entityId', entity);

*** The middleware

if an error occurs anywhere in the middleware chain other than then postcmd 

** Task template
*** TODO Object schema for req/res backend topic payload
*** TODO Implement backend api topic call
*** TODO Implement Task and Command
*** TODO Document the req/res payload
** DONE Implement register player for fucks sake
CLOSED: [2024-01-25 Thu 14:25]

** DONE Implement player.pairWristband()
CLOSED: [2024-01-26 Fri 16:26]
** DONE Implement player.unpairWristband()
CLOSED: [2024-01-26 Fri 16:26]
** DONE Implement normalization algorithms
CLOSED: [2024-01-25 Thu 17:27]

** DONE Implement wristband toggle
CLOSED: [2024-01-26 Fri 16:26]

** TODO Implement wristband register
*** DONE Object schema for req/res backend topic payload
*** DONE Implement backend api topic call
*** DONE Implement Task and Command
CLOSED: [2024-01-28 Sun 15:50]
*** DONE Document the req/res payload
CLOSED: [2024-01-28 Sun 15:50]
** TODO Implement wristband unregister
*** TODO Object schema for req/res backend topic payload
*** TODO Implement backend api topic call
*** TODO Implement Task and Command
*** TODO Document the req/res payload
** TODO Implement wristband verify
*** TODO Object schema for req/res backend topic payload
*** TODO Implement backend api topic call
*** TODO Implement Task and Command

*** TODO Document the req/res payload

* <2024-01-27 Sat>

Merge the Commander and Target.

At the onset of a new command have the Commander register a middleware
function at the pretask stage for calling its own state function.


Tasks dependent on some client state should:

1. Cache the entity
2. Invoke the pre-task state[task] method as the first middleware. (with the
   latest copy of the cached entity)
3. Invoke the post-task state[task] method as the last middleware. (with the
   latest copy of the cached entity.

* Conventions

