project.html

<div id="outline-container-org049f2dd" class="outline-3">
<h3 id="org049f2dd"><span class="section-number-3">5.1.</span> Command</h3>
</div>
<div id="outline-container-orge6b2b53" class="outline-3">
<h3 id="orge6b2b53"><span class="section-number-3">5.2.</span> Difference between events and hooks</h3>
<div class="outline-text-3" id="text-5-2">
<p>
A hook is a middleware function that becomes part of each Command. It is invoked
in the order it appears within the Command or Task sequence. As such it has no
control over its execution. It may never run because some previous hook
aborted the sequence.
</p>

<p>
Events on the other hand are not part any sequence. As such their handlers will
be invoked regardless of the sequnce itself.
</p>
</div>
</div>
<div id="outline-container-org1751063" class="outline-3">
<h3 id="org1751063"><span class="section-number-3">5.3.</span> Invoking tasks (creating commands)</h3>
</div>
<div id="outline-container-orgf928a29" class="outline-3">
<h3 id="orgf928a29"><span class="section-number-3">5.4.</span> Error handling</h3>
</div>
</div>

<div id="outline-container-org73feb10" class="outline-2">
<h2 id="org73feb10"><span class="section-number-2">6.</span> Command Targets</h2>
<div class="outline-text-2" id="text-6">
<p>
Command Targets should not need to know if a command was aborted or not.
Command targets are notified through CALLBACKS not Promises.
</p>

<p>
A callback interface is used to prevent dangling promises.
In case a command is aborted or an error occurs in the application level the
callback shall never be called.
</p>
</div>
</div>

<div id="outline-container-org23b4e26" class="outline-2">
<h2 id="org23b4e26"><span class="section-number-2">7.</span> Tasks</h2>
<div class="outline-text-2" id="text-7">
</div>
<div id="outline-container-org3238677" class="outline-3">
<h3 id="org3238677"><span class="section-number-3">7.1.</span> List packages</h3>
</div>
</div>

<div id="outline-container-org7e18151" class="outline-2">
<h2 id="org7e18151"><span class="section-number-2">8.</span> User stories</h2>
<div class="outline-text-2" id="text-8">
</div>
<div id="outline-container-org1d64aa2" class="outline-3">
<h3 id="org1d64aa2"><span class="section-number-3">8.1.</span> Administrator toggles wristband pairing mode</h3>
<div class="outline-text-3" id="text-8-1">
<p>
In order for the administrator to be able to toggle a wristbands pairing mode
the following components are required:
</p>

<p>
UI component that handles a user click
A Player instance
</p>

<p>
The player hook is a wrapper to the Player class. The hook exposes the player's
interface to
</p>
</div>
</div>
</div>


<div id="outline-container-org757c058" class="outline-2">
<h2 id="org757c058"><span class="section-number-2">9.</span> AFM Command pattern</h2>
<div class="outline-text-2" id="text-9">
<p>
target: entities
command: afm.task();
invoker: afm
client: UI, React Component
</p>


<p>
entities register through afm.
</p>
</div>
</div>



<div id="outline-container-orgde212eb" class="outline-2">
<h2 id="orgde212eb"><span class="section-number-2">10.</span> <span class="timestamp-wrapper"><span class="timestamp">&lt;2024-01-24 Wed&gt;</span></span></h2>
<div class="outline-text-2" id="text-10">
</div>
<div id="outline-container-orgaee1cce" class="outline-3">
<h3 id="orgaee1cce"><span class="section-number-3">10.1.</span> Entities as the Command initializers</h3>
<div class="outline-text-3" id="text-10-1">
<p>
The Commander entities initiate commands.
</p>

<p>
Afm caches the Player that initiated a Command for a Task.
Afm creates a Command out of the Task.
</p>


<p>
The task middleware sequence contains:
</p>

<p>
Player.task
&#x2026;middleware
Player.taskCompleted
</p>
</div>


<div id="outline-container-orgd417371" class="outline-4">
<h4 id="orgd417371"><span class="section-number-4">10.1.1.</span> The caches</h4>
<div class="outline-text-4" id="text-10-1-1">
<p>
A Map is used to contain each of the command initiating entities such as:
</p>

<ul class="org-ul">
<li>player</li>
<li>team</li>
<li>wristband</li>
</ul>


<p>
Map.get('entityId')
Map.set('entityId', entity);
</p>
</div>
</div>

<div id="outline-container-org5508b3c" class="outline-4">
<h4 id="org5508b3c"><span class="section-number-4">10.1.2.</span> The middleware</h4>
<div class="outline-text-4" id="text-10-1-2">
<p>
if an error occurs anywhere in the middleware chain other than then postcmd 
</p>
</div>
</div>
</div>

<div id="outline-container-org467dddd" class="outline-3">
<h3 id="org467dddd"><span class="section-number-3">10.2.</span> Task template</h3>
<div class="outline-text-3" id="text-10-2">
</div>
<div id="outline-container-org4ae141b" class="outline-4">
<h4 id="org4ae141b"><span class="section-number-4">10.2.1.</span> <span class="todo TODO">TODO</span> Object schema for req/res backend topic payload</h4>
</div>
<div id="outline-container-orgce86346" class="outline-4">
<h4 id="orgce86346"><span class="section-number-4">10.2.2.</span> <span class="todo TODO">TODO</span> Implement backend api topic call</h4>
</div>
<div id="outline-container-org1b8e1a1" class="outline-4">
<h4 id="org1b8e1a1"><span class="section-number-4">10.2.3.</span> <span class="todo TODO">TODO</span> Implement Task and Command</h4>
</div>
<div id="outline-container-org2376776" class="outline-4">
<h4 id="org2376776"><span class="section-number-4">10.2.4.</span> <span class="todo TODO">TODO</span> Document the req/res payload</h4>
</div>
</div>
<div id="outline-container-orge100699" class="outline-3">
<h3 id="orge100699"><span class="section-number-3">10.3.</span> <span class="done DONE">DONE</span> Implement register player for fucks sake</h3>
<div class="outline-text-3" id="text-10-3">
</div>
</div>

<div id="outline-container-org1e5432c" class="outline-3">
<h3 id="org1e5432c"><span class="section-number-3">10.4.</span> <span class="done DONE">DONE</span> Implement player.pairWristband()</h3>
<div class="outline-text-3" id="text-10-4">
</div>
</div>
<div id="outline-container-org20aacf3" class="outline-3">
<h3 id="org20aacf3"><span class="section-number-3">10.5.</span> <span class="done DONE">DONE</span> Implement player.unpairWristband()</h3>
<div class="outline-text-3" id="text-10-5">
</div>
</div>
<div id="outline-container-org2c68e55" class="outline-3">
<h3 id="org2c68e55"><span class="section-number-3">10.6.</span> <span class="done DONE">DONE</span> Implement normalization algorithms</h3>
<div class="outline-text-3" id="text-10-6">
</div>
</div>

<div id="outline-container-org32be7b3" class="outline-3">
<h3 id="org32be7b3"><span class="section-number-3">10.7.</span> <span class="done DONE">DONE</span> Implement wristband toggle</h3>
<div class="outline-text-3" id="text-10-7">
</div>
</div>

<div id="outline-container-orgba065bc" class="outline-3">
<h3 id="orgba065bc"><span class="section-number-3">10.8.</span> <span class="todo TODO">TODO</span> Implement wristband register</h3>
<div class="outline-text-3" id="text-10-8">
</div>
<div id="outline-container-org6b62d2a" class="outline-4">
<h4 id="org6b62d2a"><span class="section-number-4">10.8.1.</span> <span class="done DONE">DONE</span> Object schema for req/res backend topic payload</h4>
</div>
<div id="outline-container-org2b54ec4" class="outline-4">
<h4 id="org2b54ec4"><span class="section-number-4">10.8.2.</span> <span class="done DONE">DONE</span> Implement backend api topic call</h4>
</div>
<div id="outline-container-org546530e" class="outline-4">
<h4 id="org546530e"><span class="section-number-4">10.8.3.</span> <span class="done DONE">DONE</span> Implement Task and Command</h4>
<div class="outline-text-4" id="text-10-8-3">
</div>
</div>
<div id="outline-container-org007a945" class="outline-4">
<h4 id="org007a945"><span class="section-number-4">10.8.4.</span> <span class="done DONE">DONE</span> Document the req/res payload</h4>
<div class="outline-text-4" id="text-10-8-4">
</div>
</div>
</div>
<div id="outline-container-orgb6b11ee" class="outline-3">
<h3 id="orgb6b11ee"><span class="section-number-3">10.9.</span> <span class="todo TODO">TODO</span> Implement wristband unregister</h3>
<div class="outline-text-3" id="text-10-9">
</div>
<div id="outline-container-org592c011" class="outline-4">
<h4 id="org592c011"><span class="section-number-4">10.9.1.</span> <span class="todo TODO">TODO</span> Object schema for req/res backend topic payload</h4>
</div>
<div id="outline-container-orgf82c5c6" class="outline-4">
<h4 id="orgf82c5c6"><span class="section-number-4">10.9.2.</span> <span class="todo TODO">TODO</span> Implement backend api topic call</h4>
</div>
<div id="outline-container-org5354fdb" class="outline-4">
<h4 id="org5354fdb"><span class="section-number-4">10.9.3.</span> <span class="todo TODO">TODO</span> Implement Task and Command</h4>
</div>
<div id="outline-container-orgc2c65fe" class="outline-4">
<h4 id="orgc2c65fe"><span class="section-number-4">10.9.4.</span> <span class="todo TODO">TODO</span> Document the req/res payload</h4>
</div>
</div>
<div id="outline-container-orgbac4cac" class="outline-3">
<h3 id="orgbac4cac"><span class="section-number-3">10.10.</span> <span class="todo TODO">TODO</span> Implement wristband verify</h3>
<div class="outline-text-3" id="text-10-10">
</div>
<div id="outline-container-orgc610bbc" class="outline-4">
<h4 id="orgc610bbc"><span class="section-number-4">10.10.1.</span> <span class="todo TODO">TODO</span> Object schema for req/res backend topic payload</h4>
</div>
<div id="outline-container-org085772d" class="outline-4">
<h4 id="org085772d"><span class="section-number-4">10.10.2.</span> <span class="todo TODO">TODO</span> Implement backend api topic call</h4>
</div>
<div id="outline-container-org4677063" class="outline-4">
<h4 id="org4677063"><span class="section-number-4">10.10.3.</span> <span class="todo TODO">TODO</span> Implement Task and Command</h4>
</div>

<div id="outline-container-org708005d" class="outline-4">
<h4 id="org708005d"><span class="section-number-4">10.10.4.</span> <span class="todo TODO">TODO</span> Document the req/res payload</h4>
</div>
</div>
</div>

<div id="outline-container-org59849b2" class="outline-2">
<h2 id="org59849b2"><span class="section-number-2">11.</span> <span class="timestamp-wrapper"><span class="timestamp">&lt;2024-01-27 Sat&gt;</span></span></h2>
<div class="outline-text-2" id="text-11">
<p>
Merge the Commander and Target.
</p>

<p>
At the onset of a new command have the Commander register a middleware
function at the pretask stage for calling its own state function.
</p>


<p>
Tasks dependent on some client state should:
</p>

<ol class="org-ol">
<li>Cache the entity</li>
<li>Invoke the pre-task state[task] method as the first middleware. (with the
latest copy of the cached entity)</li>
<li>Invoke the post-task state[task] method as the last middleware. (with the
latest copy of the cached entity.</li>
</ol>
</div>
</div>
