project.org
** Commands wrap their return value within an object

Commands never return an entity object, they return an object that contains the
entity or entities.

#+begin_src js
  // Instead of:
  const response = {
    username: "...",
    name: "...",
  }

  // This:
  const response = {
    player: {
      username: "...",
      name: "...",
    },
  }
#+end_src

* Packages
** Available packages
*** mission
#+begin_src js
  { name: 'Per Mission 15', amount: 15, type: 'mission', cost: 150 }
#+end_src
*** time
#+begin_src js
  { name: 'Per Time 30', amount: 30, type: 'time', cost: 50 }
#+end_src
** Active package
*** mission
#+begin_src js
  {
    id : 1,
    name : "Per Mission 10",
    cost : null,
    started : 1706472302416,
    ended : null,
    missions : 10,
    missionsPlayed : 0,
    active : true
  }
#+end_src
*** time
#+begin_src js
  {
    id : 3,
    name : "Per Time 30",
    cost : null,
    started : 1706473426225,
    ended : null,
    duration : 1800.000000000,
    paused : false,
    active : true
  }
    #+end_src
** Inactive package
*** mission
#+begin_src json
  "packages" : [{
    "id" : 2,
    "name" : "Per Mission 5",
    "cost" : null,
    "started" : null,
    "ended" : null,
    "missions" : 5,
    "missionsPlayed" : 0,
    "active" : false
  }]
#+end_src
*** time
#+begin_src json
  "packages" : [{
    "id" : 3,
    "name" : "Per Time 30",
    "cost" : null,
    "started" : null,
    "ended" : null,
    "duration" : 1800.000000000,
    "paused" : false,
    "active" : false
  }]
#+end_src




* Normalization functions
Normalization function are used to translate and merge entity objects.

They translate objects in backend form to frontend form.

For example:

A backend wrisband has the following properties:

wristbandNumber
wristbandColor

A frontend wristband has the following properties:

id
color
colorCode

The wristband normalization function is capable of taking a backend wristband
and translating it into a frontend wristband.

A second task normalization functions fulfill, is the merging of entity objects
in any form into a single object in frontend form.

For example:

Given a set of Wristbands:

[ { wristband1...}, { wristband2...} ]

The output would be:

{ wristbandInFrontendForm... }

Each normalization function accepts some standard options.

** Normalization options
*** Wristband
normalized
state
nullSupersede
defaultState
*** Player
normalized
depth
state
nullSupersede
defaultState
wristband options

at depth = 0 -> normalizes player
at depth = 1 -> normalizes player + wrisband
*** Package
normalized
state
nullSupersede
defaultState
*** Roster
normalized
depth
state
nullSupersede
defaultState
wristband options
{ wristband, ...playerOptions};

at depth = 0 -> normalizes players
at depth = 1 -> normalizes players + wristbands
*** Team
normalized
depth
state
nullSupersede
defaultState
player options
wristband options

at depth = 0 -> normalizes team
at depth = 1 -> normalizes teams + players
at depth = 2 -> normalizes teams + players + wristbands
*** GroupParty
normalized
depth
state
nullSupersede
defaultState
player options
wristband options

at depth = 0 -> normalizes teams
at depth = 1 -> normalizes teams + players
at depth = 2 -> normalizes teams + players + wrisbands

* ToObject Functions
The tobject() functions take an entity and return the entity as an object
striped down from all unecessary properties.


For example, given a Wristband instance:


WristbandInstance = {

afm: ...
states: {
   Unregistered: ...
   Registered: ...
}
state: "",
...
}

Would produce:

WristbandInstance.tobject()

{
   id: 0,
   color: "",
   colorCode: 0,
   state: "",
}

** tobject options
*** Wrisband
none
*** Package
none
