project.html

<div id="outline-container-orgef3c17f" class="outline-2">
<h2 id="orgef3c17f"><span class="section-number-2">12.</span> Conventions</h2>
<div class="outline-text-2" id="text-12">
</div>
<div id="outline-container-org46e314f" class="outline-3">
<h3 id="org46e314f"><span class="section-number-3">12.1.</span> Commands wrap their return value within an object</h3>
<div class="outline-text-3" id="text-12-1">
<p>
Commands never return an entity object, they return an object that contains the
entity or entities.
</p>

<div class="org-src-container">
<pre class="src src-js"><span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">Instead of:</span>
<span style="color: #4f97d7; font-weight: bold;">const</span> <span style="color: #7590db;">response</span> = <span style="color: #4f97d7;">{</span>
  username: <span style="color: #2d9574;">"..."</span>,
  name: <span style="color: #2d9574;">"..."</span>,
<span style="color: #4f97d7;">}</span>

<span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">This:</span>
<span style="color: #4f97d7; font-weight: bold;">const</span> <span style="color: #7590db;">response</span> = <span style="color: #4f97d7;">{</span>
  player: <span style="color: #bc6ec5;">{</span>
    username: <span style="color: #2d9574;">"..."</span>,
    name: <span style="color: #2d9574;">"..."</span>,
  <span style="color: #bc6ec5;">}</span>,
<span style="color: #4f97d7;">}</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org4981fa3" class="outline-2">
<h2 id="org4981fa3"><span class="section-number-2">13.</span> Packages</h2>
<div class="outline-text-2" id="text-13">
</div>
<div id="outline-container-org3ab5c68" class="outline-3">
<h3 id="org3ab5c68"><span class="section-number-3">13.1.</span> Available packages</h3>
<div class="outline-text-3" id="text-13-1">
</div>
<div id="outline-container-orgb26e36e" class="outline-4">
<h4 id="orgb26e36e"><span class="section-number-4">13.1.1.</span> mission</h4>
<div class="outline-text-4" id="text-13-1-1">
<div class="org-src-container">
<pre class="src src-js"><span style="color: #4f97d7;">{</span> name: <span style="color: #2d9574;">'Per Mission 15'</span>, amount: <span style="color: #a45bad;">15</span>, type: <span style="color: #2d9574;">'mission'</span>, cost: <span style="color: #a45bad;">150</span> <span style="color: #4f97d7;">}</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org8fdf46f" class="outline-4">
<h4 id="org8fdf46f"><span class="section-number-4">13.1.2.</span> time</h4>
<div class="outline-text-4" id="text-13-1-2">
<div class="org-src-container">
<pre class="src src-js"><span style="color: #4f97d7;">{</span> name: <span style="color: #2d9574;">'Per Time 30'</span>, amount: <span style="color: #a45bad;">30</span>, type: <span style="color: #2d9574;">'time'</span>, cost: <span style="color: #a45bad;">50</span> <span style="color: #4f97d7;">}</span>
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-orge594dc9" class="outline-3">
<h3 id="orge594dc9"><span class="section-number-3">13.2.</span> Active package</h3>
<div class="outline-text-3" id="text-13-2">
</div>
<div id="outline-container-orgcdbe211" class="outline-4">
<h4 id="orgcdbe211"><span class="section-number-4">13.2.1.</span> mission</h4>
<div class="outline-text-4" id="text-13-2-1">
<div class="org-src-container">
<pre class="src src-js"><span style="color: #4f97d7;">{</span>
  id : <span style="color: #a45bad;">1</span>,
  name : <span style="color: #2d9574;">"Per Mission 10"</span>,
  cost : <span style="color: #a45bad;">null</span>,
  started : <span style="color: #a45bad;">1706472302416</span>,
  ended : <span style="color: #a45bad;">null</span>,
  missions : <span style="color: #a45bad;">10</span>,
  missionsPlayed : <span style="color: #a45bad;">0</span>,
  active : <span style="color: #a45bad;">true</span>
<span style="color: #4f97d7;">}</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org7026873" class="outline-4">
<h4 id="org7026873"><span class="section-number-4">13.2.2.</span> time</h4>
<div class="outline-text-4" id="text-13-2-2">
<div class="org-src-container">
<pre class="src src-js"><span style="color: #4f97d7;">{</span>
  id : <span style="color: #a45bad;">3</span>,
  name : <span style="color: #2d9574;">"Per Time 30"</span>,
  cost : <span style="color: #a45bad;">null</span>,
  started : <span style="color: #a45bad;">1706473426225</span>,
  ended : <span style="color: #a45bad;">null</span>,
  duration : <span style="color: #a45bad;">1800</span>.<span style="color: #a45bad;">000000000</span>,
  paused : <span style="color: #a45bad;">false</span>,
  active : <span style="color: #a45bad;">true</span>
<span style="color: #4f97d7;">}</span>
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-orgbc22baa" class="outline-3">
<h3 id="orgbc22baa"><span class="section-number-3">13.3.</span> Inactive package</h3>
<div class="outline-text-3" id="text-13-3">
</div>
<div id="outline-container-org45a628b" class="outline-4">
<h4 id="org45a628b"><span class="section-number-4">13.3.1.</span> mission</h4>
<div class="outline-text-4" id="text-13-3-1">
<div class="org-src-container">
<pre class="src src-json"><span style="color: #4f97d7; font-weight: bold;">"packages"</span> : <span style="color: #4f97d7;">[</span><span style="color: #bc6ec5;">{</span>
  <span style="color: #4f97d7; font-weight: bold;">"id"</span> : <span style="color: #a45bad;">2</span>,
  <span style="color: #4f97d7; font-weight: bold;">"name"</span> : <span style="color: #2d9574;">"Per Mission 5"</span>,
  <span style="color: #4f97d7; font-weight: bold;">"cost"</span> : <span style="color: #a45bad;">null</span>,
  <span style="color: #4f97d7; font-weight: bold;">"started"</span> : <span style="color: #a45bad;">null</span>,
  <span style="color: #4f97d7; font-weight: bold;">"ended"</span> : <span style="color: #a45bad;">null</span>,
  <span style="color: #4f97d7; font-weight: bold;">"missions"</span> : <span style="color: #a45bad;">5</span>,
  <span style="color: #4f97d7; font-weight: bold;">"missionsPlayed"</span> : <span style="color: #a45bad;">0</span>,
  <span style="color: #4f97d7; font-weight: bold;">"active"</span> : <span style="color: #a45bad;">false</span>
<span style="color: #bc6ec5;">}</span><span style="color: #4f97d7;">]</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org568262d" class="outline-4">
<h4 id="org568262d"><span class="section-number-4">13.3.2.</span> time</h4>
<div class="outline-text-4" id="text-13-3-2">
<div class="org-src-container">
<pre class="src src-json"><span style="color: #4f97d7; font-weight: bold;">"packages"</span> : <span style="color: #4f97d7;">[</span><span style="color: #bc6ec5;">{</span>
  <span style="color: #4f97d7; font-weight: bold;">"id"</span> : <span style="color: #a45bad;">3</span>,
  <span style="color: #4f97d7; font-weight: bold;">"name"</span> : <span style="color: #2d9574;">"Per Time 30"</span>,
  <span style="color: #4f97d7; font-weight: bold;">"cost"</span> : <span style="color: #a45bad;">null</span>,
  <span style="color: #4f97d7; font-weight: bold;">"started"</span> : <span style="color: #a45bad;">null</span>,
  <span style="color: #4f97d7; font-weight: bold;">"ended"</span> : <span style="color: #a45bad;">null</span>,
  <span style="color: #4f97d7; font-weight: bold;">"duration"</span> : <span style="color: #a45bad;">1800</span>.<span style="color: #a45bad;">000000000</span>,
  <span style="color: #4f97d7; font-weight: bold;">"paused"</span> : <span style="color: #a45bad;">false</span>,
  <span style="color: #4f97d7; font-weight: bold;">"active"</span> : <span style="color: #a45bad;">false</span>
<span style="color: #bc6ec5;">}</span><span style="color: #4f97d7;">]</span>
</pre>
</div>
</div>
</div>
</div>
</div>




<div id="outline-container-org1f1e0a7" class="outline-2">
<h2 id="org1f1e0a7"><span class="section-number-2">14.</span> Normalization functions</h2>
<div class="outline-text-2" id="text-14">
<p>
Normalization function are used to translate and merge entity objects.
</p>

<p>
They translate objects in backend form to frontend form.
</p>

<p>
For example:
</p>

<p>
A backend wrisband has the following properties:
</p>

<p>
wristbandNumber
wristbandColor
</p>

<p>
A frontend wristband has the following properties:
</p>

<p>
id
color
colorCode
</p>

<p>
The wristband normalization function is capable of taking a backend wristband
and translating it into a frontend wristband.
</p>

<p>
A second task normalization functions fulfill, is the merging of entity objects
in any form into a single object in frontend form.
</p>

<p>
For example:
</p>

<p>
Given a set of Wristbands:
</p>

<p>
[ { wristband1&#x2026;}, { wristband2&#x2026;} ]
</p>

<p>
The output would be:
</p>

<p>
{ wristbandInFrontendForm&#x2026; }
</p>

<p>
Each normalization function accepts some standard options.
</p>
</div>

<div id="outline-container-orgcf6763a" class="outline-3">
<h3 id="orgcf6763a"><span class="section-number-3">14.1.</span> Normalization options</h3>
<div class="outline-text-3" id="text-14-1">
</div>
<div id="outline-container-org9a78dee" class="outline-4">
<h4 id="org9a78dee"><span class="section-number-4">14.1.1.</span> Wristband</h4>
<div class="outline-text-4" id="text-14-1-1">
<p>
normalized
state
nullSupersede
defaultState
</p>
</div>
</div>
<div id="outline-container-orgb278929" class="outline-4">
<h4 id="orgb278929"><span class="section-number-4">14.1.2.</span> Player</h4>
<div class="outline-text-4" id="text-14-1-2">
<p>
normalized
depth
state
nullSupersede
defaultState
wristband options
</p>

<p>
at depth = 0 -&gt; normalizes player
at depth = 1 -&gt; normalizes player + wrisband
</p>
</div>
</div>
<div id="outline-container-org99fd190" class="outline-4">
<h4 id="org99fd190"><span class="section-number-4">14.1.3.</span> Package</h4>
<div class="outline-text-4" id="text-14-1-3">
<p>
normalized
state
nullSupersede
defaultState
</p>
</div>
</div>
<div id="outline-container-org3a3cd78" class="outline-4">
<h4 id="org3a3cd78"><span class="section-number-4">14.1.4.</span> Roster</h4>
<div class="outline-text-4" id="text-14-1-4">
<p>
normalized
depth
state
nullSupersede
defaultState
wristband options
{ wristband, &#x2026;playerOptions};
</p>

<p>
at depth = 0 -&gt; normalizes players
at depth = 1 -&gt; normalizes players + wristbands
</p>
</div>
</div>
<div id="outline-container-orge030869" class="outline-4">
<h4 id="orge030869"><span class="section-number-4">14.1.5.</span> Team</h4>
<div class="outline-text-4" id="text-14-1-5">
<p>
normalized
depth
state
nullSupersede
defaultState
player options
wristband options
</p>

<p>
at depth = 0 -&gt; normalizes team
at depth = 1 -&gt; normalizes teams + players
at depth = 2 -&gt; normalizes teams + players + wristbands
</p>
</div>
</div>
<div id="outline-container-orgfb2dceb" class="outline-4">
<h4 id="orgfb2dceb"><span class="section-number-4">14.1.6.</span> GroupParty</h4>
<div class="outline-text-4" id="text-14-1-6">
<p>
normalized
depth
state
nullSupersede
defaultState
player options
wristband options
</p>

<p>
at depth = 0 -&gt; normalizes teams
at depth = 1 -&gt; normalizes teams + players
at depth = 2 -&gt; normalizes teams + players + wrisbands
</p>
</div>
</div>
</div>
</div>

<div id="outline-container-org5fb2e4c" class="outline-2">
<h2 id="org5fb2e4c"><span class="section-number-2">15.</span> ToObject Functions</h2>
<div class="outline-text-2" id="text-15">
<p>
The tobject() functions take an entity and return the entity as an object
striped down from all unecessary properties.
</p>


<p>
For example, given a Wristband instance:
</p>


<p>
WristbandInstance = {
</p>

<p>
afm: &#x2026;
states: {
   Unregistered: &#x2026;
   Registered: &#x2026;
}
state: "",
&#x2026;
}
</p>

<p>
Would produce:
</p>

<p>
WristbandInstance.tobject()
</p>

<p>
{
   id: 0,
   color: "",
   colorCode: 0,
   state: "",
}
</p>
</div>

<div id="outline-container-org490832b" class="outline-3">
<h3 id="org490832b"><span class="section-number-3">15.1.</span> tobject options</h3>
<div class="outline-text-3" id="text-15-1">
</div>
