project.org
*** Player
depth

at depth = 0 -> do not tobject() wrisband
at depth = 1 -> tobject() wristband

*** Roster
depth

at depth = 0 -> do not tobject() wristband
at depth = 1 -> tobject() wrisband

*** Team
depth

at depth = 0 -> do not tobject() players or wristbands or packages
at depth = 1 -> tobject() packages and players
at depth = 2 -> tobject() packages and players and wristbands

* Fill functions

the .fill() functions are used to quickly produce random entities.

** fill options
*** wristband
sources
*** Package
sources
*** player
sources
depth

at depth = 0 -> do not fill() wristband
at depth = 1 -> fill() wristband

*** Roster
size
sources
depth

at depth = 0 -> do not fill() wristband
at depth = 1 -> fill() wristband

*** Team
size
sources
depth

at depth = 0 -> do not fill() wristband, or players or packages
at depth = 1 -> fill() players and packages
at depth = 2 -> fill() players and packages and wristbands

