project.html
<div id="outline-container-org240bab9" class="outline-4">
<h4 id="org240bab9"><span class="section-number-4">15.1.1.</span> Wrisband</h4>
<div class="outline-text-4" id="text-15-1-1">
<p>
none
</p>
</div>
</div>
<div id="outline-container-org1be9987" class="outline-4">
<h4 id="org1be9987"><span class="section-number-4">15.1.2.</span> Package</h4>
<div class="outline-text-4" id="text-15-1-2">
<p>
none
</p>
</div>
</div>
<div id="outline-container-org8920fb5" class="outline-4">
<h4 id="org8920fb5"><span class="section-number-4">15.1.3.</span> Player</h4>
<div class="outline-text-4" id="text-15-1-3">
<p>
depth
</p>

<p>
at depth = 0 -&gt; do not tobject() wrisband
at depth = 1 -&gt; tobject() wristband
</p>
</div>
</div>

<div id="outline-container-org64eadda" class="outline-4">
<h4 id="org64eadda"><span class="section-number-4">15.1.4.</span> Roster</h4>
<div class="outline-text-4" id="text-15-1-4">
<p>
depth
</p>

<p>
at depth = 0 -&gt; do not tobject() wristband
at depth = 1 -&gt; tobject() wrisband
</p>
</div>
</div>

<div id="outline-container-org0148e2e" class="outline-4">
<h4 id="org0148e2e"><span class="section-number-4">15.1.5.</span> Team</h4>
<div class="outline-text-4" id="text-15-1-5">
<p>
depth
</p>

<p>
at depth = 0 -&gt; do not tobject() players or wristbands or packages
at depth = 1 -&gt; tobject() packages and players
at depth = 2 -&gt; tobject() packages and players and wristbands
</p>
</div>
</div>
</div>
</div>

<div id="outline-container-org99164b3" class="outline-2">
<h2 id="org99164b3"><span class="section-number-2">16.</span> Fill functions</h2>
<div class="outline-text-2" id="text-16">
<p>
the .fill() functions are used to quickly produce random entities.
</p>
</div>

<div id="outline-container-orgde14e49" class="outline-3">
<h3 id="orgde14e49"><span class="section-number-3">16.1.</span> fill options</h3>
<div class="outline-text-3" id="text-16-1">
</div>
<div id="outline-container-orgb56feba" class="outline-4">
<h4 id="orgb56feba"><span class="section-number-4">16.1.1.</span> wristband</h4>
<div class="outline-text-4" id="text-16-1-1">
<p>
sources
</p>
</div>
</div>
<div id="outline-container-orge900c19" class="outline-4">
<h4 id="orge900c19"><span class="section-number-4">16.1.2.</span> Package</h4>
<div class="outline-text-4" id="text-16-1-2">
<p>
sources
</p>
</div>
</div>
<div id="outline-container-org89ef6c0" class="outline-4">
<h4 id="org89ef6c0"><span class="section-number-4">16.1.3.</span> player</h4>
<div class="outline-text-4" id="text-16-1-3">
<p>
sources
depth
</p>

<p>
at depth = 0 -&gt; do not fill() wristband
at depth = 1 -&gt; fill() wristband
</p>
</div>
</div>

<div id="outline-container-orgf4db622" class="outline-4">
<h4 id="orgf4db622"><span class="section-number-4">16.1.4.</span> Roster</h4>
<div class="outline-text-4" id="text-16-1-4">
<p>
size
sources
depth
</p>

<p>
at depth = 0 -&gt; do not fill() wristband
at depth = 1 -&gt; fill() wristband
</p>
</div>
</div>

<div id="outline-container-org9a1bb92" class="outline-4">
<h4 id="org9a1bb92"><span class="section-number-4">16.1.5.</span> Team</h4>
<div class="outline-text-4" id="text-16-1-5">
<p>
size
sources
depth
</p>

<p>
at depth = 0 -&gt; do not fill() wristband, or players or packages
at depth = 1 -&gt; fill() players and packages
at depth = 2 -&gt; fill() players and packages and wristbands
</p>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Created: 2024-01-31 Wed 10:19</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>